{
     "Tip": "Makale",
     "Dergi İsmi": "",
     "Üniversite İsmi": "Ankara Üniversitesi",
     "Gün": "",
     "Ay": "",
     "Yıl": "2016",
     "Cilt": "65",
     "Sayı": "4",
     "Başlık": "ULUSLARARASI ADALET DİVANININ YARGI YETKİSİ VE TREATY BODİES",
     "Title": "Jurisdiction Of International Court Of Justice And Treaty Bodies",
     "Yazar İsmi": [
          "Füsun ARSAVA"
     ],
     "Danışman İsmi": "",
     "Anahtar Kelimeler": [
          "Uluslararası Adalet Divanı’nın yargı yetkisi",
          "BM insan hakları komitesi",
          "devlet başvuru prosedürü",
          "uzlaşı prosedürü"
     ],
     "Keywords": [
          "Jurisdiction of International Court of Justice",
          "UN Human Rights Committee",
          "State procedure",
          "consensus procedure"
     ],
     "Özet": "Evrensel nitelikli insan hakları sözleşmeleri günümüzde Uluslararası Adalet Divanı’nın kararlarına ve danışma görüşlerine esas olmaktadır. Makalede Uluslararası Adalet Divanı’nın anlaşmaya yahut uluslararası Adalet Divanı statüsünün 36.madde, 2.fıkrasına istinat eden yargı yetkisini kullanması bakımından insan hakları sözleşmelerinde öngörülen denetim mekanizmasının tüketilmesinin gerekip gerekmediği hususu insan hakları sözleşmeleri örneklerinde ele alınmış ve değerlendirilmiştir.",
     "Abstract": "Universal human rights conventions are taken as a basis for decisions and advisory judgement of International Court of Justice. This article evaluates and instantiates with human rights conventions the necessity of exhaustion of control mechanism that assumed in human rights conventions within the context of jurisdiction of International Court of Justice in Statute of the International Court of Justice article 36 paragraph 2 or agreement.",
     "Metin": "60 yılı aşkın bir süredir mevcudiyetini sürdüren evrensel nitelikli insan hakları sözleşmeleri yakın tarih itibariyle Uluslararası Adalet Divanı önünde görülen davalara esas olmaya başlamıştır. Soykırımı Konvansiyonu Bosna-Hersek ve Hırvatistan tarafından Yugoslavya Cumhuriyeti/Sırbistan Cumhuriyetine karşı açılan davada1; BM işkenceyi önleme konvansiyonu, ırk ayrımcılığı konvansiyonu, kadın hakları konvansiyonu Demokratik Kongo Cumhuriyeti ve Ruanda arasındaki davada2, BM Medeni ve Siyasi Haklar Sözleşmesi Gine Cumhuriyeti ve Kongo Cumhuriyeti arasındaki davada3, ırk ayrımcılığını yasaklayan Konvansiyon Gürcüstan ve Rusya Federasyonu arasındaki davada4, BM işkenceyi önleme konvansiyonu Belçika ve Senegal arasındaki davada5 Uluslararası Adalet Divanının kararlarına esas olan evrensel nitelikli insan hakları sözleşmeleri arasında yer almaktadır. Buna ilave olarak karşımıza çıkan iki danışma görüşü prosedüründe de Divanın insan hakları sözleşmelerini kendine esas aldığı görülmektedir. Divan nükleer silahların kullanılması ile ilgili danışma görüşünde BM Medeni ve Siyasi Haklar Sözleşmesini6; işgal edilen Filistin topraklarında Israil’in inşa ettiği duvarla ilgili danışma görüşünde BM Medeni ve Siyasi Haklar Sözleşmesi yanısıra BM Ekonomik, Sosyal ve Kültürel Haklar Sözleşmesini ve BM Çocuk Hakları Konvansiyonunu görüşüne esas almıştır7. Bu davalardan asgari birkaçında – insan hakları sözleşmesinin bir Treaty Body olarak denetim organı veya özel bir devlet başvuru prosedürü öngördüğü durumlarda – Uluslararası Adalet Divanının anlaşmaya yahut Uluslararası Adalet Divanı statüsünün 36.madde, 2.fıkrasına istinat eden yargı yetkisini kullanmasının önkoşulu olarak öncelikle sözkonusu insan hakları sözleşmesinde öngörülen prosedürlerin tüketilmesinin gerekip gerekmediği sorusu cevaplandırılmıştır. Uluslararası Adalet Divanının anlaşmalara istinat eden yargı yetkisi ve devlet başvuruları İnsan hakları sözleşmesinde öngörülen denetim organına devletlerin başvurusu ve Uluslararası Adalet Divanının anlaşmaya istinat eden yargı yetkisi arasındaki ilişkiye ait sorunun tartışılması bağlamında Gürcistan’ın BM ırk ayrımcılığını yasaklayan konvansiyonunun (CERD) 22.maddesine istinaden Rusya aleyhine 2008’de açtığı dava örnek olarak ele alınmaktadır8. CERD’in 22.maddesi görüşmeler yoluyla yahut sözleşmede açıkça öngörülen prosedür üzerinden çözülemeyen uyuşmazlıkların Uluslararası Adalet Divanına getirilebileceğini öngörmektedir. Bu hükme istinaden Rusya Federasyonu dava edilen taraf olarak Uluslararası Adalet Divanı nezdinde dava açmanın ırk ayrımcılığı Konvansiyonundaki 11-13 maddelerinde öngörülen devlet başvurusu prosedürünün tüketilmesi ertesinde mümkün olabileceği itirazını yapmıştır9. BM çerçevesinde akdedilen birçok insan hakları sözleşmesinin anlaşma organı olarak bir denetim komitesi öngörmesi yanısıra, uyuşmazlığın çözümü için Uluslararası Adalet Divanının yargı yetkisini subsidier olarak kabul ettiği görülmektedir. Bu durum 1965 tarihli CERD’in 22.maddesinde; 1975 tarihli kadınlara karşı ayrımcılığın ortadan kaldırılması sözleşmesinin 29.maddesinde; 1984 tarihli BM işkenceyi önleme konvansiyonunun 30.maddesinde; 1990 tarihli göçmen işçiler konvansiyonunun 92.maddesinde; 2006 tarihli kaybolmalara karşı yapılan BM konvansiyonunun 42.maddesinde kabul edilen tablodur. Bu çerçevede dikkat çekici olan husus uzlaşı yolu ile Uluslararası Adalet Divanının yargı yetkisini kabul eden bu sözleşmelerden sadece ikisinde anlaşmada öngörülen denetim organına başvurunun açıkça Uluslararası Adalet Divanının yargı yetkisini kullanmasının önkoşulu olarak kabul edilmiş olmasıdır. Bu durum ilk evrensel insan haklarını koruma sözleşmesi olan ırk ayrımcılığını yasaklayan BM Konvansiyonunda (CERD) karşımıza çıkmaktadır. Konvansiyonda, Konvansiyondan doğan mükellefi-yetlere riayeti denetlemek üzere oluşturulan komiteye Konvansiyonun 11-13 maddeleri muvacehesinde CERD Komitesine yapılacak devlet başvuruları Uluslararası Adalet Divanının yargı yetkisini kullanmasının önkoşulu olarak öngörülmüştür. Evrensel insan hakları sözleşmelerinde yer alan uzlaşı kuralı ve devlet başvuruları prosedürü Irk ayrımcılığının önlenmesi konvansiyonunun 22.maddesi “Any dispute two or more States Parties with respect to the interpretation or application of this Convention, which is not settled by negotiation or by the procedures expressly provided for in this Convention, shall, at the request of any of the parties to the dispute, be referred to the International Court of Justice for decision, unless the disputants agree to another mode of settlement” hükmünü öngörmektedir. Bu formül Konvansiyonun oluşum prosesinde ulaşılan uzlaşı sonucu ortaya çıkmıştır. Egemenlik düşüncesine öncelik veren devletler sözleşmeden doğan mükellefiyetlere riayeti denetlemek üzere oluşturulan CERD Komitesinin denetimini yeterli bulurken, diğer devletler denetim komitesinin kapsamlı yetkisinden bağımsız olarak Uluslararası Adalet Divanının yargı yetkisinin koşulsuz olarak kabul edilmesi görüşünü savunmuştur. Farklı görüşlerin savunulmasının sonucu olarak CERD’in 22.maddesi bir uzlaşı olarak Uluslararası Adalet Divanının yargı yetkisini diğer koşulların yerine getirilmesi koşuluna bağlı olarak kabul etmiştir. Bu şekilde uyuşmazlık konusu Uluslararası Adalet Divanı önüne gelmeden önce CERD komitesinde tartışılacak ve gerektiği takdirde uyuşmazlığın çözümü için uzlaşı prosedürünün uygulanması söz konusu olacaktır. CERD’in 22.maddesinde sözleşmede öngörülen prosedürün Uluslararası Adalet Divanına davanın gelmesinden önce işletilmesi gerekliliğinin açıkça vurgulanması, CERD komitesinin uyuşmazlıkların çözümünde öncelikle başvuru organı olarak kabul edildiğini göstermektedir10 . CERD tasarısının görüşmeleri esnasında UNESCO’ya ilişkin 1962 tarihli protokolün benzer mekanizma öngören 25.maddesine yapılan atıf BM İnsan Hakları Komisyonunun da CERD’in 13.maddesinde öngörülen arabuluculuk prosedürünün insan hakları karakterli uyuşmazlıklar bakımından uygun olduğu görüşüne katıldığını göstermektedir11 . BM Genel Kurulu 3.Komite çalışmalarında Polonya UA Adalet Divanının uzlaşıya istinaden davalara bakma yetkisinin kabulünü gündeme getirmiştir. Gana, Mauritanya ve Filipin’in inisiyatifi ile tasarıya “or by the procedures expressly provided for in this Convention” kelimelerinin eklenmesi suretiyle Divan nezdinde dava açılmadan önce Konvansiyonda öngörülen prosedürün işletilmesi gerekliliği üzerinde uzlaşı sağlanmıştır. Divanın bu şekilde uyuşmazlıkların çözüm mekanizmasında “of last resort” olarak tasarrufta bulunması kabul edilmiştir12 . Irk ayrımcılığını yasaklayan Konvansiyonun uyuşmazlıkların intern çözümü prosedüründe CERD Komitesinin öncelikli bağlayıcı ve zorunlu yetkisinin kabul edilmesi muvacehesinde Konvansiyonun 22.maddesinde “uyuşmazlıkların görüşmeler veya Konvansiyonda öngörülen devlet başvurusu yoluyla çözümü” ifadesinde yer alan “veya” sözcüğünün bir alternatifi ifade için değil, CERD Komitesi denetiminin devre dışı bırakılma riskini ortadan kaldırmak için “kümülatif” anlamda kullanıldığı kabul edilmektedir. Şüphesiz CERD’de öngörülen bu gereklilik Divanın CERD’in 22.maddesine istinaden yetkilerini kullanması durumunda ortaya çıkmaktadır. Bunun dışında Uluslararası Adalet Divanının ırk ayrımcılığını yasaklayan Konvansiyonun yorumuna ve uygulanmasına ilişkin diğer uluslararası anlaşmalara veya Uluslararası Adalet Divanı statüsünün 36.maddesine istinat eden yetkileri aynen kalmaktadır. BM Medeni ve Siyasi Haklar Sözleşmesinin 44.maddesi BM Medeni ve Siyasi Haklar Sözleşmesi ırk ayrımcılığını yasaklayan konvansiyonundan kısa bir süre sonra yapılmıştır. Bu sözleşmede CERD’in 22.maddesi paralelinde Uluslararası Adalet Divanının yetkisini öngören bir uzlaşı kuralının kabulü, sözleşmenin 41.maddesinde öngörülen devlet başvurusu ile uzlaşı kuralı arasındaki ilişkiyi açıklamak bakımından oldukça yararlı olabilirdi. Ancak bu yöndeki girişimler BM Medeni ve Siyasi Haklar Sözleşmesinin hazırlıkları esnasında akamete uğramıştır. İnsan Hakları Komisyonunun 1954’de hazırladığı tasarıda, 41.madde, 1.fıkra, b-bendi veya 42.madde, 7.fıkra, c-bendine göre yürütülen devlet başvurusu prosedürünün sonuç vermemesi durumunda prosedüre taraf olan devletin insan hakları komitesinin raporunu hazırlaması ertesinde Uluslararası Adalet Divanı nezdinde dava açma hakkından söz edilmesine karşılık bu yöndeki girişimler BM Medeni ve Siyasi Haklar Sözleşmesinin hazırlıkları esnasında dikkate alınmamıştır. Tasarıda öngörülen bu formül CERD’in 22.maddesinde karşımıza çıkan formülden başkası değildir. BM Medeni ve Siyasi Haklar Sözleşmesine ilişkin bu öneri BM Medeni ve Siyasi Haklar Sözleşmesi için kabul görmemesine karşılık CERD’te yerini almıştır. Bununla beraber BM Medeni ve Siyasi Haklar Sözleşmesinin 44.maddesinde CERD’in 16.madde, 2.cümlesine istinaden yeni bir formül kabul edilmiştir. Buna göre, bu sözleşmenin yürütülmesine ilişkin hükümler anlaşma tarafı devletlerin kendi aralarında yürürlükte bulunan genel yahut özel uluslararası anlaşmalarda uluslararası uyuşmazlıkların çözümü için öngörülen diğer prosedürlerin uygulanmasını etkilemeyecektir. BM Medeni ve Siyasi Haklar Sözleşmesinin 41.maddesi prensip olarak uyuşmazlıkların intern çözüm yolu ile Uluslararası Adalet Divanının diğer bir dayanağa istinaden yargı yetkisini birlikte kullanmasını reddetmemektedir. BM Medeni ve Siyasi Haklar Sözleşmesinde öngörülen intern çözüm yolu CERD’in 22.maddesinden farklı olarak kendiliğinden işlememektedir. Bu durum CERD’in 16.maddesinin ilk yarım cümlesinde karşımıza çıkan formüle BM Medeni ve Siyasi Haklar Sözleşmesinin 44.maddesinde neden yer verilmediğini açıklamaktadır. Şimdiye dek CERD’in 16.maddesi yahut Medeni ve Siyasi Haklar Sözleşmesinin 44.maddesi ile ilgili olarak görüş bildirme olanağına sahip olmayan Divan, prosedüre taraf olan devletlerden hiçbirisinin (Demokratik Kongo Cumhuriyeti, Gine ve Uganda) BM Medeni ve Siyasi Haklar Sözleşmesinin 41.maddesine istinaden devlet başvurusunu kabul etmemesi nedeni ile BM Medeni ve Siyasi Haklar Sözleşmesi ihlâllerine ilişkin görüşlerini Uluslararası Adalet Divanı statüsünün 36.madde, 2. fıkrasına istinaden ortaya koymuştur. Bu çerçevede BM Medeni ve Siyasi Haklar Sözleşmesinin 41.maddesi üzerinden insan hakları komitesinin ve Adalet Divanı statüsünün 36.maddesine istinaden Uluslararası Adalet Divanının eş zamanlı olarak aynı uyuşmazlıkla iştigal etmesinin herşeyden önce BM Medeni ve Siyasi Haklar Sözleşmesinin 44.maddesinin lex specialis karakteri nedeniyle imkânsız olduğunun dikkate alınması gerekmektedir.Kadınlara karşı ayrımcılığın her türünün ortadan kaldırılmasına ilişkin anlaşmanın (CEDAW) 29.maddesi Gerek uzlaşı kuralının, gerekse intern denetim komitesinin öngörüldüğü ırk ayrımcılığını yasaklayan konvansiyonun ve BM Medeni ve Siyasi Haklar Sözleşmesinin akdinden sonra bir diğer insan haklarını koruma sözleşmesi olarak BM Kadın Hakları Konvansiyonu akdedilmiştir13 . CEDAW’ın 29.maddesinde uyuşmazlıkların çözümüne ilişkin olarak yer alan düzenleme CEDAW’a ilişkin ihtiyari protokol çerçevesinde devlet başvurusunun kabul edilip edilmemesi ile bağlantılı olarak geç bir tarihte tartışma konusu olarak gündeme gelmiştir. Müzakerelerde bu sorunun nihai gündemden çıkması ile beraber olası bir uzlaşı kuralı bağlamında uyuşmazlıkların intern çözümünün tüketilmesi koşulunun gereği kalmamış ve CEDAW ile aynı tarihlerde müzakere edilen “International Convention Against the Taking of Hostages”ın anlaşmaya özgü denetim organı öngörmeyen 16.maddesi lâfzen aynen CEDAW’ın 29.maddesinde üstlenilmiştir. Madde hükmünde uyuşmazlık konularının CEDAW’ın 29.maddesinde atıfta bulunulan hakemlik mahkemesine veya Uluslararası Adalet Divanına götürülmeden CEDAW komitesinin konuyla iştigal etmesi gereği bu şekilde açıkça reddedilmiştir. İşkence, vahşi, insanlık dışı yahut aşağılayıcı muamele veya cezalara ilişkin BM anlaşmasının 30.maddesi (CAT) İşkence ve diğer vahşi, insanlık dışı yahut aşağılayıcı muamele yahut cezalara ilişkin 1984 tarihli BM konvansiyonu (CAT) gerek devlet başvurusunu (21.md.), gerekse uzlaşı kuralını (30.md.) öngören (hakemlik mahkemesinin ve Uluslararası Adalet Divanının yetkisini), ancak iki madde arasındaki ilişkiyi CERD’in 22.maddesinden farklı olarak düzenlemeyen ilk insan haklarını koruma anlaşmasıdır14. İşkenceyi yasaklayan BM konvansiyonunun müzakerelerinin başlamasından itibaren CERD’in 22.maddesini esas alan bir uyuşmazlıkları çözme kuralının konvansiyona alınması önerileri gündeme gelmiştir15. 1983’te Hollanda CAT’in bilahare 30.maddesini oluşturan hükmünü müzakereci devletlerin siyaseten desteklemesinin söz konusu olduğu bir dönemde, devlet başvurusu prosedürüne ilişkin, ancak ipucu içermeyen bir öneri yapmıştır. Uluslararası Adalet Divanının zorunlu yargı yetkisi sorununun tartışmalı olması nedeniyle müzakereler esnasında CEDAW’ın 29.maddesi esas alınarak uzlaşma kuralı hakemlik mahkemesinin primer yetkisi kabul edilerek genişletilmiş ve optingout ile hakemlik mahkemesinin yetkisinin dışında kalma olanağı ve konvansiyonun21.maddesinde düzenlenen devlet başvurusu prosedürü ile ilişki konusuna değinilmeden Uluslararası Adalet Divanının yardımcı yetkisi kabul edilmiştir. Bu sorun CEDAW’ın 29.maddesi çerçevesinde CEDAW’da devlet başvurusunun öngörülmemesi nedeniyle doğmamaktadır. Bu durum CAT’in 21.maddesine göre gerek devlet başvurusu prosedürünü kabul eden devletler bakımından, gerekse CAT’in 30.maddesine göre hakemlik mahkemesinin yetkisini ve hakemlik prosedürünün akamete uğraması halinde Uluslararası Adalet Divanının yetkisini reddetmeyen devletler bakımından, her iki uyuşmazlık çözüm organının eş zamanlı olarak uyuşmazlıkla iştigal etmesinin mümkün olup olmadığı sorununu, diğer bir ifade ile iki prosedürün birbiri ile ilişkisi sorununu gündeme getirmektedir. Dayanak olarak öncelikle CAT’in 22.madde, 5.fıkra, 1.bendi hükmünün argumentum e contrario yorumu esas alınmakla beraber, CAT 21.maddesinin CAT denetim komitesinin devlet başvurusu prosedürü ile başka bir uyuşmazlık çözüm mekanizmasının eş zamanlı olarak yahut öncelikli olarak kullanılmasını yasaklamadığının gözardı edilmemesi gerekmektedir. Denetim komitesi anlaşmaya göre hakemlik mahkemesine yahut Uluslararası Adalet Divanına CAT’in 30.maddesine göre başvuru yapıldıktan sonra veya eş zamanlı olarak bir devletin başvurusu üzerine denetim yetkisini kullanabilir. Bunun tersi olarak, devlet başvurusu yapılmadan yahut bu sürecin henüz tamamlanmadığı bir aşamada CAT’ın 30.maddesinde öngörülen Hakemlik Mahkemesinin veya Uluslararası Adalet Divanının yetkisini kullanmasının mümkün olup olmadığı sorusunun cevabı verilmemiştir. Uluslararası Adalet Divanının yetkisini sınırlama etkisi gösteren böyle bir yaklaşım herşeyden önce CERD’in 22.maddesindeki formülasyonu üstlenmeyen CAT’in 30.maddesi lâfzına uygun düşmemesi nedeniyle anlaşma taraflarınca ancak açıkça kabul edildiği takdirde ileri sürülebilir (devlet başvurusu prosedürü Uluslararası Adalet Divanında cereyan eden prosedürden farklı olarak uluslararası hukuk bakımından bağlayıcı sonuçlar getirmemektedir). Böyle bir yorum, CAT’in 21.maddesine göre bildirim yapmayarak CAT’in devlet başvurusu prosedürüne tabi olmak istemeyen, ancak diğer taraftan CAT’in 30.madde, 2.fıkrasına göre opting-out yapmayan devletlerin CAT’in 30.maddesinde atıfta bulunulan hakemlik mahkemesi veya Uluslararası Adalet Divanı nezdinde konvansiyonun ihlâli nedeniyle, üçüncü mercilerin denetimini kabul etme iradesine sahip olmamalarına rağmen daha kolay dava edilmesini mümkün kılmaktadır. Söz konusu sonuca götüren yorumun 21.maddeye göre bildirim yapmayan devletin iradesine uygun düştüğünü ileri sürmek mümkün değildir. Devlet başvuru prosedürünün (CAT’ın 21.md. göre) ve uzlaşı prosedürünün akamete uğraması CAT’ın 30.maddesi muvacehesinde bir uyuşmazlığın mevcut olduğuna ilişkin ipucu olarak değerlendirilebilmekle beraber Uluslararası Adalet Divanının Gürcistan - Rusya Federasyonu davasında kararına esas aldığı gibi, CERD’in 22.maddesinde öngörülen amaçlar ışığında CAT’ın 30.maddesi ile lâfzen aynı olan CERD’in 22.maddesinin genel uluslararası hukuka göre 30.madde ile uyum içinde olduğundan ve bu çerçevede anlaşmaya özgü spesifik değişikliklerin tespit edilmediğinden hareket edilmesi mümkündür16 . Sonuç olarak CAT’ın açıkça bir hakemlik prosedüründen söz etmesi nedeniyle, CAT’in 21.madde, 1.fıkra, e-bendinde öngörülen uzlaşı prosedürünün hakemlik prosedürü hakkında mutabakat sağlanamaması sonucu akamete uğraması durumunda, CAT’ın 30.madde, 1.fıkrası muvacehesinde Uluslararası Adalet Divanına giden yol otomatik olarak açılmamaktadır. Bütün bunlardan devlet başvurusu prosedürünün (CERD md.21) ve CAT’ın 30.maddesinde öngörülen uzlaşı kuralının birbirleriyle bağlantılı olmadan yan yana bulundukları sonucu çıkmaktadır. CAT’in 30.maddesinin hakemlik mahkemesinin yahut Uluslararası Adalet Divanının konuyla iştigal etmesini engelleyici etkisi ancak konvansiyonda CERD’in 16.maddesi yahut BM Medeni ve Siyasi Haklar Sözleşmesinin 44.maddesi paralelinde hakemlik mahkemesinin yahut Uluslararası Adalet Divanının kümülatif olarak konuyla iştigal etmesine izin veren bir dayanağa yer verilmemesi durumunda mümkün olabilirdi. Şüphesiz anlaşmalarda yer verilen bu kurallar prensip olarak denetleme komitesi bağlamında öngörülen intern prosedür ve uyuşmazlıkların çözümü için anlaşma dışında öngörülen extern prosedür arasındaki ilişkiyi düzenlemektedir. Bu nedenle böyle bir düzenlemenin anlaşma metninde yer almamasının CAT’in 30.maddesi muvacehesinde hakemlik mahkemesinin yahut Uluslararası Adalet Divanının devlet başvurusu yapılmadan yetkilerini kullanmamasına yol açan bir etki doğurmaması gerekmektedir. Çocuk hakları konvansiyonu ve 3 nolu ihtiyari protokol Ne çocuk hakları konvansiyonu, ne de henüz yürürlüğe girmemiş olan ve 21.maddesinde devlet başvurusu öngören 2011 tarihli 3 nolu ihtiyari protokol Uluslararası Adalet Divanının yetkisini düzenleyen bir uzlaşı kuralı içermektedir. Bunun sonucu olarak bir taraftan Uluslararası Adalet Divanının yetkisini kullanma ve diğer taraftan çocuk hakları komitesinin devlet başvurusu üzerine konuyla iştigal etme olasılığı uyuşmazlık doğurma potansiyeline sahip bir konu olarak ortaya çıkmaktadır. CERD’in 16.maddesine ve BM Medeni ve Siyasi Haklar Sözleşmesinin 44.maddesine benzer bir düzenlemenin 3 nolu ihtiyari protokolde yer almaması, çocuk hakları konvansiyonunun ve ek protokolün 12.maddesinde öngörülen devlet başvuru prosedürünün icrasının, konvansiyonun yahut protokolün ihlâli nedeniyle Uluslararası Adalet Divanına davayı getirmek bakımından conditio sine qua non özellik taşımadığını göstermektedir. 3 nolu protokolün özellikle yüksek bir uluslararası denetim standardı getirme yaklaşımı ışığında, Konvansiyon ve Konvansiyona ilişkin protokollerin Uluslararası Adalet Divanının yetkilerini sınırlamak yahut koşullara bağlamak suretiyle başka mekanizmaların uygulanmasını engelleme iradesine sahip olduğu yönünde yorumlanması doğru değildir. Göçmen işçilerin ve aile bireylerinin haklarının korunmasına ilişkin Konvansiyonun (CMRW) 92.maddesi Orijinal metni itibariyle uzlaşı kuralı ve devlet başvuru prosedürü öngörmeyen çocuk hakları konvansiyonundan farklı olarak çocuk hakları konvansiyonundan birkaç ay sonra akdedilen göçmen işçilerin ve aile bireylerinin haklarına ilişkin konvansiyonun 92.maddesi diğer insan haklarını koruma anlaşmalarında ve bu meyanda CEDAW’ın 29.maddesinde ve CAT’in 30.maddesinde yer aldığı gibi standart bir düzenleme olarak uzlaşı kuralı içermektedir. Konvansiyonun 92.maddesinde kadın hakları konvansiyonunun yapısal farklılığı, bu meyanda devlet başvuru prosedürünün eksikliği dikkate alınmadan CEDAW’ın 29.maddesine atıf yapılmıştır (CAT’ın 30.maddesine atıf yapılmamıştır). Konvansiyonun 92.maddesinde CAT’ın 30.maddesinde olduğu gibi bir intern uyuşmazlık çözüm prosedürüne atıfta bulunulmaması, diğer bir ifade ile BM işkenceyi önleme konvansiyonu gibi sadece Treaty Body oluşturmakla kalmayıp, 76.maddesinde devlet başvurusu prosedürünün öngörülmesi ırk ayrımcılığının önlenmesi sözleşmesinde ve BM Medeni ve Siyasi Haklar Sözleşmesinde olduğu gibi devlet başvurusu prosedürü ile anlaşma tarafları arasında mevcut diğer uyuşmazlıkları çözme mekanizmalarına dokunmama yaklaşımının benimsenildiğini ortaya koymaktadır17 . BM Engellilerin Haklarının Korunması Anlaşması ve Ek Protokol BM Engelliler Konvansiyonu ve buna ilişkin 2006 tarihli ihtiyari protokol diğer insan haklarının korunması anlaşmalarında olduğu gibi bir denetim komitesi oluşturmuştur. Ancak ne anlaşmanın kendisi ne de ek protokol devlet başvuru prosedürüne ve uzlaşı kuralına yer vermiştir. İnsanları Kaybolmaktan Koruyan Uluslararası Anlaşmanın (CPED) 42.Maddesi BM engelliler konvansiyonundan çok kısa bir süre sonra yapılan CPED, CERD’in 22.maddesinde olduğu gibi 42.maddesinde öngörülen hakemlik mahkemesinin uyuşmazlık konusuyla iştigalini, uyuşmazlığın anlaşmada öngörülen müzakere yahut açıkça öngörülen diğer bir prosedürle çözümlenememesi durumunda kabul etmektedir. Bu çerçevede dikkat çekici olan husus o zamanki İnsan Hakları Komisyonuna bağlı “sub-commission on Prevention of Discrimination and Protection of Minorities” tarafından kabul edilen 1998 tarihli “Draft international convention on the protection of all person from forced disappearance”de uyuşmazlıkların çözümüne ilişkin bir düzenlemeye yer verilmemesidir. İnsan hakları komisyonunun çalışmaları esnasında kurulan “open-ended Working Group to elaborate a draft legally binding normative instrument for the protection of all persons from enforced disappearance” 2005 tarihli son toplantısında CPED’in 42.maddesi Iran’ın itirazına rağmen kabul edilmiştir18 . Irk ayrımcılığının önlenmesi konvansiyonundan farklı olarak CPED’ın 32.maddesine göre devlet başvurusu prosedürünün işletilmesi konvansiyonda öngörülen hakemlik mahkemesine başvurunun önkoşulu ise de, CPED’in 42.maddesi, CERD’in 22.md farklı olarak, madde hükmünde hakemlik prosedürünün icrası koşullarını öngörülmektedir. Bu çerçevede anlaşma metnini hazırlayan çalışma grubunun nihai raporunda CPED’in 42.maddesinde formüle edilen uzlaşı kuralının CERD’in 22.maddesine istinat ettiğine vurgu yapılması dikkat çekicidir. CERD’in 22.maddesine yapılan bu atıf dikkate alınmadığı takdirde, CERD’e ilişkin yapısal fark olarak, CERD’in 11 – 13 maddelerine göre devlet başvurusunun zorunlu olmasına karşılık, CPED’de devlet başvurusunun ihtiyari olduğunu ve 33 anlaşma tarafı devletin sadece 12’sinin bugün için devlet başvurusunu kabul ettiğini söyleyebiliriz. Bunun anlamı bugün için ihtiyari başvuruyu kabul etmeyen 21 devlet bakımından CPED komitesinin hakemlik mahkemesine gitmeden önce devlet başvurusu prosedürü çerçevesinde konuyla iştigal etme mükellefiyetinin bulunmamasıdır. CERD için olduğu gibi burada da konvansiyondaki denetim mekanizmasının etkinliğini sağlamak için, her koşulda müzakerelerin yanı sıra devlet başvurusu prosedürünün işletilmesinden hareket edildiği görülmektedir19 . CPED’in 22.maddesi lâfzına göre müzakerelerin cereyan etmesi ve aynı şekilde anlaşmada öngörülen uyuşmazlıkların çözüm prosedürünün işletilmesi, hakemlik prosedürünün işletilmesinin önkoşuludur. Uluslararası Adalet Divanı nezdinde dava açılması CPED’in 42.maddesi lafzına göre, uyuşmazlık taraflarının 6 ay içinde çözüm yolları konusunda anlaşamamalarına bağlıdır. Bu çerçevede başka olasılıklar da düşünülebilir. Örneğin, CPED’in 42.madde, 1.cümlesine göre hakemlik prosedürünün işletilmesi için önkoşul teşkil eden devlet başvurusu prosedürünün cereyan etmemesi değil, örneğin tarafların hakemlik prosedürünün seçeneklerine ilişkin olarak anlaşamamaları söz konusu olduğu takdirde, uyuşmazlığın tek taraflı olarak CPED’in 32.maddesine göre devlet başvurusu prosedürünün işletilmesi gerekliliği olmaksızın Uluslararası Adalet Divanı önüne getirilmesi mümkündür. CPED’in 42.maddesinin lâfzı yanısıra CERD’in 22.maddesi ile yapılan bir karşılaştırma – bu hükümde anlaşmada öngörülen prosedür ve uluslararası mahkeme nezdinde açılan dava birbiri ile açık şekilde bağlanmaktadır – gerçek durumun farklı olduğunu ortaya koymaktadır. Diğer taraftan CPED’in 42.maddesinin sistematik yorumu farklı bir sonuç getirmektedir; CPED’in 42.maddesi üç aşamalı bir prosedür öngörmektedir: birinci aşamada, anlaşmada öngörülen çözüm yolu olarak müzakerelerin yapılması gerekmektedir; ikinci aşamada hakemlik prosedürü ve üçüncü aşamada, ultimo ratio olarak Uluslararası Adalet Divanında dava açılması söz konusudur. Bu durum uyuşmazlık taraflarının hakemlik prosedürünün olasılıkları konusunda (yahut taraflardan birinin hakemlik müessesesini işletmek istememesi durumunda) anlaşamamaları nedeniyle hakemlik prosedürünün akamete uğraması halinde, devlet başvuru prosedürünün CPED’in 32.maddesine göre ex ante işletilmesinin CPED’in 42.maddede öngörülen yetkinin kullanılması için conditio sine qua non teşkil ettiğini göstermektedir. Değerlendirme Birbirinden farklı insan haklarını koruma anlaşmalarının uyuşmazlıkların çözümüne ilişkin kurallarının analizi bu konuda açık bir fotoğrafın olmadığını göstermektedir. Devlet başvurusu prosedürü öngören yahut öngörmeyen yahut uzlaşı kuralı içeren yahut içermeyen, devlet başvurusu prosedürüne bu çerçevede sadece atıfta bulunan anlaşmalar yan yana bulunmaktadır. Buna ilave olarak Treaty Bodies’in kendi nezdlerinde cereyan eden prosedürü takip eden yargı prosedürü üzerindeki spesifik etkisi konusunda açık bir yaklaşım ortaya konulmamaktadır. Bu çerçevede sadece 1965 tarihli ilk önemli evrensel insan haklarını koruma anlaşması olarak ırk ayrımcılığını yasaklayan anlaşma ve diğer taraftan şimdilik en son yapılan insan haklarını koruma anlaşması niteliğini taşıyan insanları kaybolmaktan korumaya matuf olmak üzere yapılan uluslararası anlaşma devlet başvurusu prosedürüne sadece atıfta bulunmaktadır. Bu tür atıflar gerek devlet başvurusu prosedürünü, gerekse uzlaşı kuralını içeren, örneğin BM işkencenin önlenmesi konvansiyonunda olduğu gibi, insan haklarını koruma anlaşmalarında yer almamaktadır. İnsan haklarını koruma anlaşması yapan devletler anlaşmaların efendisi olarak Uluslararası Adalet Divanının uyuşmazlıkları çözme yetkisini kabul edip etmemek yahut hangi koşullar altında Divanın yetkisini kabul edecekleri konusunda ve anlaşmalarda öngörülen Treaty Bodies ile Uluslararası Adalet Divanının ilişkisini düzenleme konusunda ellerini serbest tutmak istemektedir. Uluslararası Adalet Divanı statüsünün 36.madde, 2.fıkrasına göre Divanın kullandığı yetki ve devlet başvurusu prosedürü Devlet başvurusu prosedürünün icra edilmemesi Uluslararası Adalet Divanının uzlaşı kuralı içeren insan haklarını koruma anlaşmalarına istinat eden yetkisi üzerinde etkisi olduğu gibi, Divan statüsünün 36.madde 2.fıkrasına göre kullandığı yetkiler üzerinde de etkisi bulunmaktadır. Uyuşmazlıkların diğer çözüm yolları ile çözümüne ilişkin çekince yapılmaksızın Divan statüsünün 36.madde, 2.fıkrasına istinaden Divanın yargı yetkisinin kabulüne ilişkin bildiri yapılması Sürekli Adalet Divanı tarafından vurgulanan prensipten hareket edilerek, uluslararası Adalet Divanının yargı yetkisine farklı dayanakların esas olabileceği, prensip olarak bu dayanakların birbirinden bağımsız şekilde yan yana bulunabileceği ve bu farklı dayanakların birbirini negatif etkilemek yerine tamamlayacağı kabul edilmektedir. Sürekli Adalet Divanı Divana yargı yetkisi tanıyan anlaşmalardan ve 36.madde, 2.fıkraya istinat eden tek taraflı bildirilerden hareket etmiştir20 . Uyuşmazlık taraflarının karşılıklı mutabakatla - buna anlaşmalarda kararlaştırılan devlet başvurusu prosedürü dahil olabilir - başka bir barışçı çözüm yolunu seçmeleri halinde, uyuşmazlık taraflarından birinin Uluslararası Adalet Divanı statüsünün 36.madde, 2.fıkrasına göre yaptığı tek taraflı bildiride, Divanın yargı yetkisine uyuşmazlık konusu bakımından istisna getirmesi mümkündür. Uluslararası Adalet Divanı statüsünün 36.madde, 2.fıkrasına istinat eden bildirinin mevcut uyuşmazlık çözüm prosedürleri lehine çekince ile yapılmasına Almanya’nın 2008 tarihli Uluslararası Adalet Divanı statüsünün 36.madde, 2.fıkrasına istinat eden bildirisi bir örnek oluşturmaktadır. Almanya söz konusu tek taraflı bildirisinde uyuşmazlığın diğer taraflarıyla başka bir barışçı çözüm yoluyla uyuşmazlığı çözme konusunda anlaştığı yahut anlaşacağı yahut mutabakatla başka bir barışçı çözüm yolu seçtiği uyuşmazlıklar istisna olmak üzere Divanın yargı yetkisini kabul etmiştir21 . Böyle bir çekincenin Divanın yargı yetkisini sınırlayan sonuçlarının insan haklarını koruma anlaşmalarının ihlâlleri nedeniyle gündeme gelmesi durumunda – devlet başvurusu prosedürünün anlaşmada öngörülmesi nedeniyle – anlaşmada öngörülen denetim organının devlet başvurusu prosedürü çerçevesindeki yetkisinin spesifik anlaşmanın ihlâlleri ile sınırlı olduğunun gözardı edilmemesi gerekmektedir. Spesifik insan haklarını koruma anlaşmalarının ihlâllerini aşan uyuşmazlık konuları ve paralel uluslararası teamül hukuku normlarının ihlâli çerçevesinde Uluslararası Adalet Divanının yargı yetkisine getirilen çekinceler buna karşılık geçerli kabul edilmemektedir22 . Uluslararası Adalet Divanı Statüsünün 36.madde, 2.fıkrasına istinaden Uluslararası Adalet Divanı’nın yargı yetkisinin kabulüne ilişkin olarak yapılan bildirilerde yer alan bu tür çekinceler sadece uluslararası hukuka göre bağlayıcı sonuçlar doğuran uyuşmazlıkların çözüm prosedürleri ile sınırlı yapılmamaktadır. Divanın yargı yetkisinin kabulüne ilişkin olarak şimdiye dek yapılan 67 bildiriden 44’ünde bu tür çekince yapılmıştır. Bu bağlamda Belçika, Belçika-Senegal uyuşmazlığında CAT’in 21.maddesine istinat etmiştir23 . 36.madde 2.fıkraya göre yapılan bildirilerde kullanılan uyuşmazlığın barışçıl çözümü kavramı BM anlaşmasının VI. Bölüm başlığında ve BM anlaşmasının 33.madde, 1.fıkra ve 2.fıkrasında karşımıza çıkmaktadır. 33.maddede öngörülen arabuluculuk gibi çözüm yolları taraflar bakımından bağlayıcı sonuç doğurmaz. Diğer taraftan 33.madde, 1.fıkrada çözüm yolları tüketici sayılmamıştır. Örneğin BM Medeni ve Siyasi Haklar Sözleşmesinin 41.maddesinde öngörülen devlet başvuru prosedürü 33.madde, 1.fıkrada sayılan bir çözüm yolu değildir. Japonya, Avusturya, Peru gibi bir grup devlet ise 36.madde, 2.fıkraya istinaden yaptıkları bildiride Uluslararası Adalet Divanının yargı yetkisine sınırlama getiren barışçı çözüm yollarını, uyuşmazlık tarafları bakımından nihai ve bağlayıcı kararlar alınan çözüm yollarıyla sınırlamışlardır. 36.madde, 2.fıkraya istinaden bir diğer grup devlet yaptıkları bildirilerde Avusturya’nın 1971’de yaptığı bildiriyi dikkate alarak çekincelerini uluslararası hukuka göre prosedürün bağlayıcı kararla sona ermesi koşuluna bağlamamıştır. Devlet başvurusu prosedürü bağlayıcı bir kararla sonuçlanmasa da Uluslararası Adalet Divanının yargı yetkisi yapılan çekince ile sınırlanmış olmaktadır. Uluslararası Adalet Divanı Statüsünün 36.madde, 2.fıkrasının öngördüğü sistem çekinceleri Uluslararası Adalet Divanının yargı yetkisine tabî olma bildirisinin ayrılmaz bir parçası haline getirmiştir. BM Deniz Hukuku Konvansiyonunun 298.maddesine göre yapılan bildirilerle Divanın mevcut yargı yetkisini uyuşmazlıkları başka barışçı yöntemlerle çözmeye matuf olarak bilâhare sınırlayan bildiriler birbirinden farklıdır24 . 36.madde, 2.fıkraya göre yapılan bildiriler Divanın yargı yetkisine esas olduğu nispette, bildirilerde yapılan çekincelerin dar yorumlanmaması gerekmektedir. CERD’in 22.maddesi ve CPED’in 42.maddesi devlet başvurusu prosedürünü uyuşmazlıkların çözüm prosedürü olarak kabul etmiştir. Söz konusu anlaşmalara ilişkin bir ihlâl iddiası yapıldığında, öngörülen devlet başvurusu prosedürünün sonucu bağlayıcı olmasa da, 36.madde, 2.fıkrasına istinat eden bildirilerde yapılan çekinceler uyuşmazlık taraflarının başka bir barışçı çözüm yolu konusunda anlaştıklarına işaret etmektedir. Çekincelerin lâfzında uyuşmazlıkların çözüm sonucuna değil, uyuşmazlık taraflarının başka bir barışçı çözüm yolu konusunda anlaşmalarına vurgu yapıldığının gözardı edilmemesi gerekmektedir. Sonuç olarak yukarıda analiz edilen insan haklarını koruma anlaşmalarında öngörülen uzlaşı kuralları ile tek taraflı bildirilerde yapılan çekinceler arasında yapısal bir paralellik olduğu ortaya çıkmaktadır. Devlet başvurusu prosedürünün işletilme olasılığı Uluslararası Adalet Divanın 36.madde, 2.fıkrasına istinat eden yetkisini otomatik olarak bloke etmemektedir. Devletler burada da insan haklarını koruma anlaşmalarında uzlaşı kuralının formüle edilişinde olduğu gibi, 36.madde, 2.fıkraya istinat eden bildirilerinde devlet başvurusu prosedürü dahil olmak üzere diğer uyuşmazlık çözüm yollarına atıfta bulunan çekinceler yaparak aynı etkiyi sağlayabilir. Sonuç İdeal bir uluslararası hukuk dünyasında hukuk yollarının tüketilmesi muvacehesinde aynı uyuşmazlık için ilgili insan haklarını koruma anlaşmasına göre bir taraftan devlet başvurusu prosedürünün, diğer taraftan Uluslararası Adalet Divanı prosedürünün hukuk yollarının tüketilmesi gereksinimi ile birbiriyle bağlanması iyi bir çözüm olarak düşünülebilir. Mükerrer çalışmaların önlenmesi, diğerine saygı, konuya yakın müessesenin önceliği, uyuşmazlık konusuna ilişkin hazırlıklardan yararlanma subsidiarite prensibi gibi kriterler bu yaklaşımı desteklerken, anlaşmalarda öngörülen Treaty Bodies ve Uluslararası Adalet Divanı arasındaki olası rekabet ve uyuşmazlık tehlikesi, bu olasılıkların uluslararası hukukun parçalanmasına yol açma riski bu yaklaşımdan uzak durulmasına yol açmaktadır. Analizlerin gösterdiği gibi devletler münferit insan hakları koruma anlaşmalarının efendileri olarak anlaşmalarda devlet başvurusu prosedürünü ve uzlaşı kuralını kabul etseler de, kural olarak birçok durumda devlet başvurusu prosedürünü Uluslararası Adalet Divanı Statüsünün 36.madde, 2.fıkrasına istinaden, çoğu kez çekincelerle Uluslararası Adalet Divanı prosedürünü büyük ölçüde birbiriyle bağlantısız olarak yanyana kabul etmektedir. Münferit insan haklarını koruma anlaşmalarına ilişkin yorumlarıyla bağlantılı olarak Uluslararası Adalet Divanının Treaty Bodies’lerin kararlarını kendine esas alması bu çerçevede sadece anlaşmaların yorumlarıyla sınırlı da olsa olumlu bir değişikliğe işaret etmektedir; bu durum ileride spesifik insan haklarını koruma anlaşmalarının denetleme organları ile Uluslararası Adalet Divanı arasında somut uyuşmazlık bağlamında bağlantı kurulmasına matuf bir yakınlaşma beklentisi yaratmaktadır.",
     "Kaynakça": ""
}