{
     "Tip": "Makale",
     "Dergi İsmi": "",
     "Üniversite İsmi": "Ankara Üniversitesi",
     "Gün": "",
     "Ay": "",
     "Yıl": "2016",
     "Cilt": "65",
     "Sayı": "4",
     "Başlık": "CEZA HUKUKUNDA TÜZEL KİŞİLERİN SORUMLULUĞU ŞİRKETLER HAKKINDA YAPTIRIM UYGULANMASI",
     "Title": "The Responsibility Of Legal Persons In Criminal Law Application Of Sanctions On Companies",
     "Yazar İsmi": [
          "Prof. Dr. Nur CENTEL"
     ],
     "Danışman İsmi": "",
     "Anahtar Kelimeler": [
          "Özel hukuk tüzel kişisi",
          "şirketler",
          "faaliyet izninin iptali",
          "müsadere",
          "güvenlik tedbiri",
          "idari para cezası"
     ],
     "Keywords": [
          "Private law legal person",
          "trade corporations",
          "cancellation of permit",
          "confiscation",
          "security measure",
          "administrative fine"
     ],
     "Özet": "5237 Sayılı Türk Ceza Kanunu’nda tüzel kişiler suç faili sayılmamakta (TCK m.20), sadece özel hukuk tüzel kişilerine Yasa’da gösterilen bazı suçlar dolayısıyla güvenlik tedbiri uygulanması öngörülmektedir (TCK m.60). Bunlar 5237 sayılı TCK m.60’a göre, “kamu kuruluşlarınca verilen faaliyet izninin iptali” ile “müsadere” olmaktadır. Kamu kuruluşlarınca verilen faaliyet izninin iptal edilmesi ile müsadereye başvurulmasının işlenen fiile nazaran daha ağır sonuç doğurabileceği hallerde bu tedbirlere hükmedilmemesi mümkündür (TCK m.60/3). Tüzel kişilere ödenecek yaptırımlar arasında “adli para cezası” bulunmamaktadır. Ancak, 2009 yılında yapılan düzenlemeyle 5326 sayılı Kabahatler Kanunu m.43/A’da bazı suçlardan dolayı özel hukuk tüzel kişileri hakkında idari para cezasına hükmedilmesi öngörülmüştür. Özel hukuk tüzel kişisi olan anonim, limitet, kolektif ve komandit şirketler hakkında güvenlik tedbiri ile idari para cezası uygulanması söz konusu olacaktır.",
     "Abstract": "The Turkish Criminal Code numbered 5237 does not regard legal persons as perpetrators of crime, (TCC Art. 20) however, private law legal persons may be subjected to certain security measures because of the commission of certain crimes enumerated in the Code. (TCC Art. 60) According to TCC Art. 60, these measures are “cancellation of the permit issued by public authorities” and “confiscation”. It is possible not to rule for the application of these measures if being subject to them would create a result that is heavier on the legal person than the offence in question. (TCC Art. 60/3) “Judicial fine” is not among the sanctions applicable to legal persons. On the other hand, it is possible for legal persons to be subjected to administrative fines pursuant to Article 43/A of the Misdemeanors Code after the amendment of 2009. Security measures and administrative fines may be imposed on joint stock corporations, limited liability corporations, general partnerships and commandite companies which are private law legal persons.",
     "Metin": "Tüzel kişiler, toplumsal yaşamın gerekli kıldığı amaç birlikleridir. Bunlar, bireylerin dağınık olan güçlerini bir araya getirmek, maddi, manevi veya diğer çıkarlarını pekiştirmek işlevini görürler. Siyasi partiler, vakıflar, ticaret şirketleri tüzel kişilik örnekleridir. 5237 Sayılı Türk Ceza Kanunu’nda tüzel kişiler suç faili sayılmamakta (TCK m.20), sadece özel hukuk tüzel kişilerine bazı suçlar dolayısıyla güvenlik tedbiri uygulanması öngörülmektedir (TCK m.60). Dolayısıyla, özel hukuk tüzel kişisi olan anonim, limitet, kolektif ve komandit şirketler hakkında güvenlik tedbiri uygulanması söz konusu olacaktır. Yasa koyucu tüzel kişileri suç faili saymamakla tüzel kişilerin niteliği konusundaki gerçeklik ve varsayım teorilerinden ikincisini kabul etmiş olmaktadır. Belirtelim ki, Türk Ceza Yasası’nda sadece özel hukuk tüzel kişilerine yaptırım uygulanması öngörülerek kamu tüzel kişileri ile özel hukuk tüzel kişileri arasında ayırım yapılması, kanun önünde eşitlik ilkesine aykırı olmaktadır. Çünkü her iki tüzel kişilik türünde de suç ancak tüzel kişinin organı veya temsilcisi olan kişiler tarafından işlenebilir. Organ veya temsilcisinin, kamu tüzel kişisi yararına suç işlemesi de olanaksız değildir. Buna rağmen, kamu hukuku tüzel kişisine güvenlik tedbiri şeklinde bir yaptırım uygulanamayacaktır. Önceki dönemden söz edilecek olursa, 1 Haziran 2005 tarihine kadar yürürlükte bulunan 765 sayılı Türk Ceza Yasası’nda tüzel kişilerin suç faili olmaları ve ceza sorumlulukları konusunda herhangi bir hükmün yer almadığına değinilmesi gerekir. O dönemde öğretide cezaların şahsiliği ilkesinden hareketle tüzel kişilerin suç faili olamayacakları kadar; olabilecekleri görüşü de ileri sürülmekteydi2. Anayasa Mahkemesi, tüzel kişilerin ceza sorumluluğunun Anayasa’ya aykırı olmadığı düşüncesindeydi. Yüksek Mahkeme, tüzel kişilerin yasaların önleyici etkisinden uzak bulundurularak özgürce faaliyetlerine yer verilmesinin toplumun güvenliği açısından sakıncalı olacağını; bu nedenle tüzel kişilerin yapılarına uygun bir ceza sorumluluğu altında bulundurulmalarının kabulünün gerektiğini belirtmekteydi3. O dönemde özel yasalarda tüzel kişiler hakkında cürüm karşılığı olan ağır para cezası yaptırımının öngörüldüğü hükümler bulunduğu gibi; 2000’li yıllarda 765 sayılı Türk Ceza Kanunu bakımından da yasakoyucu tüzel kişilerin suç faili olarak cezalandırılması eğilimini açıkça ortaya koymuştu. Örneğin, 765 sayılı TCK m.220’de rüşvet verme suçları tüzel kişilerin yetkili temsilcileri tarafından işlendiğinde bunlar cezalandırılmakla birlikte tüzel kişi hakkında da suçla elde edilen menfaatin iki katından üç katına kadar ağır para cezasına hükmolunması öngörülmüştü. Tüzel kişilerin kabahat faili olmaları ve haklarında kabahatten dolayı idari tedbir veya idari para cezası uygulanması ise yürürlükteki mevzuata göre mümkündür (KK m.8, m.43/A). Kabahat dolayısıyla idari yaptırım uygulanması bakımından tüzel kişilerin niteliği arasında herhangi bir ayrım yapılmamıştır (KK m.8). Ancak, 5326 sayılı Kabahatler Yasasına sonradan eklenen ve bazı suçlardan dolayı tüzel kişiler hakkında idari para cezası verilmesinin öngörüldüğü 43/A. maddede 5237 sayılı Türk Ceza Yasası’nda olduğu gibi yine sadece özel hukuk tüzel kişilerine yer verilmiştir. Karşılaştırmalı hukukta tüzel kişilere suç veya kabahatten dolayı yaptırım uygulanması kabul edilmektedir. Tüzel kişiler için ceza hukuku anlamında sorumluluğun İngiltere, Fransa ve (şirketler için olmak üzere) İsviçre’de kabul edildiği görülmektedir. Almanya ve İtalya’da ise tüzel kişilerin idari para cezası sorumluluğu vardır. Yani tüzel kişiler bu ülkelerde kabahat faili olabilirler4. Fransız Ceza Yasası’nda, devlet dışındaki tüzel kişilerin ceza sorumluluğunun bulunduğu belirtilerek (m.121-2)5, Yasa’nın çeşitli maddelerinde tüzel kişiler suç faili olarak gösterilmektedir. Danimarka Ceza Yasası’nda da tüzel kişilerin ceza sorumluluğu kabul edilmiştir (m.25 vd.)6. Avrupa Birliği Hukukunda belli konularda tüzel kişilerin de sorumluluğunun öngörüldüğü düzenlemeler bulunmaktadır7. Tüzel kişi veya birlik yararına organlarından bir, temsilcisi veya tüzel kişi ya da birlik adına hareket eden veya hukuki veya fiili olarak topluluk adına karar verme yetkisine sahip olan diğer herhangi bir kişi tarafından Avrupa Topluluğunun Mali Çıkarlarının Korunmasına İlişkin Sözleşme’de gösterilen suçlar işlendiğinde, bu suçlardan tüzel kişiler ve kendine ait malvarlığı bulunan topluluklar ceza hukuku kapsamında sorumlu olacaktır. Öngörülen yaptırımlar, para cezası ve/veya mahkeme gözetimidir. Ayrıca, ek yaptırımlar da bulunmaktadır8. Avrupa Konseyince tüzel kişilerin sorumluluğunun taraf ülkenin hukuk sistemindeki ilkeler doğrultusunda hukuki, cezai veya idari olabileceği kabul edilmektedir.II. Şirketler Hakkında Güvenlik Tedbiri Uygulanması 5237 Sayılı Türk Ceza Kanunu’na göre, bir kamu kurumunun verdiği izne dayalı olarak faaliyette bulunan özel hukuk tüzel kişisinin organ veya temsilcilerinin iştirakiyle ve bu iznin verdiği yetkinin kötüye kullanılması suretiyle tüzel kişi yararına işlenen kasıtlı suçlardan mahkûmiyet halinde iznin iptaline karar verilir ve müsadere hükümleri uygulanır (TCK m.60/1,2). İznin iptal edilmesi ile müsadereye hükmedilmesinin işlenen fiile nazaran daha ağır sonuç doğurabileceği hallerde bu tedbirlere hükmedilmemesi mümkündür (TCK m.60/3). Tüzel kişi hakkında uygulanacak güvenlik tedbirlerine, her suç bakımından değil, kanunda özel olarak belirtilen hallerde hükmedilebilir (TCK m.60/4). Dolayısıyla bir suçu düzenleyen kanun maddesinde tüzel kişi hakkında güvenlik tedbirine hükmedileceği açıkça gösterilmedikçe, şirketler hakkında herhangi bir güvenlik tedbiri uygulanamaz. Öte yandan, şirketler hakkında güvenlik tedbiri uygulanması için öncelikle kasıtlı bir suçun işlenmesi gerekir. Suç niteliği taşımayan eylemler (örneğin kabahatler) dolayısıyla şirketlere güvenlik tedbiri uygulanmaz. Ancak, tüzel kişiler 5326 sayılı Kabahatler Kanunu’na göre organ ve temsilcilerinin davranışlarından sorumlu olurlar; kabahatten dolayı tüzel kişi hakkında idari yaptırım uygulanabilir (KK m.8). Şirketler dahil tüzel kişiler hakkında hükmedilen güvenlik tedbirine ilişkin ilam mahkeme tarafından Cumhuriyet başsavcılığı’na gönderilir ve infaz defterine kaydedilir. Cumhuriyet başsavcılığı, bu ilamı, tedbirin niteliğine göre ilgili şirketin faaliyetine izni vermeye yetkili makamlara bildirir. Bu makamlarca yargı kararının gereği yerine getirildikten sonra durum Cumhuriyet başsavcılığına bildirilir ve ilam iade edilir (Ceza İnfaz Kurumlarının Yönetimi ile Ceza ve Güvenlik Tedbirlerinin İnfazı Hakkında Tüzük m.63). III. Şirketler Hakkında Güvenlik Tedbiri Uygulanabilecek Suçlar 5237 Sayılı Türk Ceza Kanunu’na göre, şirket ve diğer özel hukuk tüzel kişileri hakkında her suç bakımından değil, kanunda özel olarak gösterilen hallerde güvenlik tedbiri uygulanabilir (TCK m.60/4). Bu suçlara bakıldığında korunan hukuki değer bakımından şu haklar dikkati çekmektedir: Yaşama hakkı, vücut bütünlüğü, özgürlük, özel yaşamın dokunulmazlığı, malvarlığı, çevrenin korunması, kamu sağlığı, genel ahlak, ekonomi, sanayi, ticaret, bilişim, kamu idaresinin güvenilirliği ve işleyişi, adliye, devletin güvenliği, anayasal düzen ve bu düzenin işleyişi. Ancak, yasakoyucu bir şirket adına işlenmesi ihtimali aşağıda gösterilen suçlarla aynı veya daha yüksek olan ve ayrımcılığa karşı bireyleri korumak gibi bir hukuki değeri hedefleyen “iş ve çalışma hüriyetinin ihlali” (TCK m.117), “sendikal hakların kullanılmasının engellenmesi” (TCK m.118) ve “nefret ve ayrımcılık” (TCK m.122) gibi suçlar için tüzel kişiye güvenlik tedbiri uygulanmasını öngörmemiştir. 5237 Sayılı Türk Ceza Kanununda yer alan ve tüzel kişiler hakkında güvenlik tedbiri uygulanabileceği gösterilen suçlar şunlardır: Soykırım (TCK m. 76), insanlığa karşı suçlar (TCK m. 77), soykırım veya insanlığa karşı suç işlemek amacıyla örgüt kurmak (TCK m. 78), göçmen kaçakçılığı (TCK m. 79), insan ticareti (TCK m. 80), insan üzerinde deney (TCK m. 90), organ veya doku ticareti (TCK m. 91), tehdit, şantaj, cebir, kişiyi hürriyetinden yoksun kılma (TCK m. 106-111), haberleşmenin gizliliğini ihlal (TCK m. 132), kişiler arasındaki konuşmaların dinlenmesi ve kayda alınması (TCK m. 133), özel hayatın gizliliğini ihlal (TCK m. 134), kişisel verilerin kaydedilmesi ( TCK m. 135), verileri hukuka aykırı olarak verme veya ele geçirme (TCK m. 136-137), verileri yok etmeme (TCK m. 138-140), hırsızlık (TCK m. 141-147), güveni kötüye kullanma (TCK m. 155), dolandırıcılık (TCK m. 157-160), çevrenin kasten kirletilmesi (TCK m. 181), uyuşturucu ve uyarıcı madde imal ve ticareti suçları (TCK m. 188), müstehcenlik (TCK m. 226), fuhuş (TCK m. 227), kumar oynanması için yer ve imkan sağlama (TCK m. 228), ihaleye fesat karıştırma (TCK m. 235), edimin ifasına fesat karıştırma (TCK m. 236), fiyatları etkileme (TCK m. 237), kamuya gerekli şeylerin yokluğuna neden olma (TCK m. 238), ticari sır, bankacılık sırrı veya müşteri sırrı niteliğindeki bilgi veya belgelerin açıklanması (TCK m. 239), mal veya hizmet satımından kaçınma (md. 240), tefecilik (TCK m. 241), bilişim sistemine girme (TCK m. 243), sistemi engelleme, bozma, verileri yok etme veya değiştirme (TCK m. 244), banka veya kredi kartlarının kötüye kullanılması (TCK m. 245), rüşvet (TCK m. 252), suçtan kaynaklanan malvarlığı değerlerini aklama (TCK m. 282), devletin birliğini ve ülke bütünlüğünü bozma (TCK m. 302), devlete karşı savaşa tahrik (TCK m. 304), Anayasa’yı ihlal (TCK m. 309). 5237 Sayılı Türk Ceza Kanunu’nda gösterilen bu suçlardan dolayı tüzel kişiye adli para cezası verilemeyecek olmakla birlikte, aşağıda gösterileceği üzere, suçların bir kısmı için 5326 sayılı Kabahatler Kanunu’na 2009 yılında eklenen m.43/A uyarınca idari para cezasına hükmedilmesi söz konusu olacaktır. 5607 Sayılı Kaçakçılıkla Mücadele Kanunu m.4’e göre, bu Kanun’da tanımlanan suçların tüzel kişinin faaliyeti çerçevesinde veya yararına olarak işlenmesi halinde ayrıca bunlara özgü güvenlik tedbirlerine hükmolunur. IV. Güvenlik Tedbirine Hükmedilemeyecek Haller Şirketler ve diğer özel hukuk tüzel kişileri hakkında güvenlik tedbiri hükümlerinin uygulanmasının, işlenen fiile nazaran daha ağır sonuçlar ortaya çıkarabileceği durumlarda hakim bu tedbirlere hükmetmeyebilir (TCK m.60/3). Örneğin şirket hakkında güvenlik tedbirinin uygulandığında çok sayıda kişinin işsiz kalacak olması halinde mahkeme güvenlik tedbirlerine karar vermeyebilir. V. Güvenlik Tedbiri Türleri Güvenlik tedbiri türleri faaliyet izninin iptali ile müsaderedir10. 1. Faaliyet İzninin İptali Faaliyet izninin iptali, tüzel kişinin izin konusuyla sınırlı olarak faaliyette bulunmasının engellenmesidir (TCK m.60). İlaç üreten bir şirketin uyuşturucu madde imal etmesi halinde faaliyet izninin iptal edilmesi gibi. Faaliyet izninin iptalinin süreli veya süresiz olacağı konusunda Yasa’da bir açıklık bulunmamaktadır. Tedbirin uygulanması şu koşulların bulunmasına bağlıdır: -Şirketin bir kamu kurumunun verdiği izin çerçevesinde faaliyet göstermesi, -Şirketin özel hukuk tüzel kişisi olması, -İşlenen suçun kasıtlı olması ve suç ile verilen iznin kullanılması arasında nedensellik bağının bulunması, -Suçun şirketin organ veya temsilcilerinin iştirakiyle işlenmiş olması ve bunlar hakkında mahkumiyet kararı verilmiş bulunması. - Yasada, bu suç için tüzel kişi hakkında güvenlik tedbiri uygulanacağının gösterilmiş bulunması. 2. Müsadere Müsadere, işlenen suçla bağlantılı eşyanın veya kazancın mülkiyetinin devlete geçmesi demektir. Eşya müsaderesi, kasıtlı bir suçun işlenmesinde kullanılan veya suçun işlenmesine tahsis edilen ya da suçtan meydana gelen eşyanın mülkiyetinin devlete geçmesidir. Kazanç müsaderesi ise, suçun işlenmesiyle elde edilen veya suçun konusunu oluşturan ya da suçun işlenmesi için sağlanan maddi menfaatler ile bunların değerlendirilmesi veya dönştürülmesi sonucu ortaya çıkan ekonomik kazançların mülkiyetinin devlete geçmesidir. Kazanç müsaderesine hükmedilmesi, söz konusu maddi menfaatin suçun mağduruna iade edilmemesi koşuluna bağlıdır. Bir şirket yararına işlendiği belirlenen suç bakımından, koşulları gerçekleşmiş ise, TCK m. 54 ve 55 çerçevesinde o suçla bağlantılı olan eşya veya kazancın müsaderesine hükmedilecektir. Bunun için aranan koşullar şunlardır: - Suçla bağlantılı eşyanın iyi niyetli üçüncü kişilere ait olmaması, - Eşyanın kasıtlı bir suçun işlenmesine tahsis edilmiş, suçtan meydana gelmiş veya üretimi, bulundurulması, kullanılması, taşınması, alım-satımı yasak eşya veya ekonomik değer olması, - Suçun özel hukuk tüzel kişisinin yararına işlenmiş olması ve failler hakkında mahkumiyet kararı verilmiş bulunması, - Yasada, bu suç için tüzel kişi hakkında güvenlik tedbiri uygulanacağının gösterilmiş olması, - Mahkeme kararı bulunması. VI. Şirketler Hakkında Suç Dolayısıyla İdari Para Cezası Uygulanması 5237 Sayılı Türk Ceza Kanunu’nda tüzel kişiler için uygulanması öngörülen güvenlik tedbirleri iznin iptali ile müsadere olarak gösterilmiş; adli para cezası sorumluluğu ise kabul edilmemiştir. Ancak, yasa koyucu bunun eksikliğini hissetmiş olacak ki, 2009 yılında 5326 sayılı Kabahatler Kanunu’na eklenen 43/A. maddesiyle bazı suçlardan dolayı tüzel kişi hakkında idari para cezasına hükmedilmesi öngörülmüştür11. Bu konuda yetkili olan, yargılama yapmakla görevli mahkemedir. Bu düzenleme sui generis bir düzenlemedir. Çünkü hükümde gösterilen eylemler suç, karşılığında gösterilen yaptırım kabahat yaptırımı, düzenlemenin yer aldığı yasa da Kabahatler Kanunu’dur. Hükmün gerekçesinde, taraf olduğumuz uluslararası sözleşmeler bakımından uluslararası alanda maruz kalınan eleştirilerin önüne geçilmek istendiği belirtilmektedir. Bu maddede TCK m.60’da olduğu gibi yine sadece özel hukuk tüzel kişilerinin sorumluluğu düzenlenmiştir. Ancak, KK m.8’de ise “tüzel kişi” şeklinde genel bir ifade kullanıldığından, kamu hukuku tüzel kişileri de kabahatten dolayı sorumlu olabileceklerdir. 5326 Sayılı Kabahatler Kanunu m.43/A hükmüne göre, belli suçlar işlendiğinde tüzel kişiye on bin Türk lirasından iki milyon Türk lirasına kadar idari para cezası verilmesi şu koşulların bulunmasına bağlıdır: -Eylemin daha ağır idari para cezasını gerektiren bir kabahat oluşturmaması, -Eylemin bir özel hukuk tüzel kişisinin organ veya temsilcisi ya da organ veya temsilci olmamakla birlikte bu tüzel kişinin faaliyeti çerçevesinde görev üstlenen bir kişi tarafından işlenmesi, -Katalog suçlardan birinin söz konusu olması. Katalog listede yer alan suçlar şunlardır: Dolandırıcılık (TCK m.157- 158), ihaleye fesat karıştırma (TCK m.235), edimin ifasına fesat karıştırma (TCK m.236), rüşvet (TCK m.252), suçtan kaynaklanan malvarlığı değerlerini aklama suçu (TCK m.282), bankacılık zimmeti (5411 sayılı Bankacılık K m.160), kaçakçılık suçları (5607 sayılı Kaçakçılıkla Mücadele K), petrol kaçakçılığı (5015 sayılı Petrol Piyasası Kanunu ek m.5) ve terörün finansmanı suçu (TMK m.8). Ancak, 3713 sayılı Terörle Mücadele Kanunu’nun terörün finansmanına ilişkin 8. maddesi 7.2.2013 gün ve 6415 sayılı Terörizmin Finansmanının Önlenmesi Hakkında Kanun m.18’le yürürlükten kaldırılmıştır. Halen 6415 sayılı Kanun m.4/4’te terörizmin finansmanı suçunun bir tüzel kişinin faaliyeti çerçevesinde işlenmesi halinde güvenlik tedbiri uygulanması öngörülmektedir. Aynı Yasa’nın 15/2. maddesinde ise bu Yasa’ya göre malvarlığının dondurulmasıyla ilgili alınan kararın gereğini yerine getirmeyen kişinin bir tüzel kişinin organ veya temsilcisi olması veya organ veya temsilcisi olmamakla birlikte, tüzel kişinin faaliyeti çerçevesinde görev üstlenmiş bulunması halinde ayrıca bu tüzel kişiye on bin liradan yüz bin liraya kadar idari para cezası verilmesi öngörülmüştür. Kabahatler Kanunu m.43/A başarılı bir düzenleme değildir. Katalog listede hükmün kapsamındaki suçların tek tek sayılmasına karşın, “eylemin daha ağır idari para cezasını gerektiren bir kabahat oluşturmaması”nın öngörülmesinin ne anlama geldiği anlaşılamamaktadır. Eylem, katalog suçlardan birini teşkil etmediğinde zaten bu yaptırımın uygulanması sözkonusu olmayacaktır. Öte yandan, hukukumuzda suç karşılığında öngörülebilecek yaptırım “adli para cezası”dır. Oysa Kabahatler Kanunu m.43/A’da “idari para cezası” uygulanması öngörülmektedir. Bu hüküm sistemi ihlal eden bir düzenlemedir; aynı zamanda yasakoyucunun tüzel kişilere uygulanacak en etkili yaptırımın para cezası olduğunu kabul etmesi ve 5237 sayılı Türk Ceza Kanunu’nda tüzel kişilerle ilgili düzenlemelerin gerçekçi olmadığını itiraf etmesi demektir. VII. Şirketlerin Kabahatten Dolayı Sorumlulukları Tüzel kişilerin kabahatten dolayı sorumluluğu 5326 sayılı Kabahatler Kanunu m.8’de düzenlenmiştir. Buna göre, organ veya temsilcilik görevi yapan ya da organ veya temsilci olmamakla birlikte tüzel kişinin faaliyeti çerçevesinde görev üstlenen kişinin bu görevi kapsamında işlemiş bulunduğu kabahatten dolayı tüzel kişi hakkında da idari yaptırım uygulanabilir. İdari yaptırımlar idari para cezası ve idari tedbirlerdir. İdari tedbirler mülkiyetin kamuya geçirilmesi ve ilgili kanunlarda yer alan diğer tedbirlerdir (KK m.16). İdari para cezasının hangi bütçeye gelir kaydedileceği cezayı veren makamın kamu idaresi, sosyal güvenlik kurumları, mahalli idareler, diğer kamu kurum ve kuruluşları veya Cumhuriyet başsavcılıkları ile mahkeme olmasına göre farklılık gösterir (KK m.17). İdari yaptırım kararı verme yetkisi ilgili yasada açıkça gösterilen idari kurul, makam veya kamu görevlisi ya da Cumhuriyet savcısı ile mahkemedir (KK m.22-24). Kabahatler Kanunu m.8’de tüzel kişinin türü açısından herhangi bir sınırlandırma bulunmamaktadır. Dolayısıyla, kabahat sorumlululuğu hem kamu hukuku tüzel kişileri ve hem de özel hukuk tüzel kişileri açısından sözkonusu olur. Hangi fiillerin kabahat oluşturduğu yasada açıkça tanımlanacağı gibi, yasada kapsam ve koşullar bakımından belirlenen çerçeve hükmün içeriği, idarenin genel ve düzenleyici işlemleriyle de doldurulabilir. Ancak kabahat karşılığı olan yaptırımların türü, süresi ile miktarı sadece yasayla belirlenebilir (KK m.4). Tüzel kişilerin sorumluluğuyla ilgili olarak özel bazı yasalarda da hükümler bulunmaktadır. Örneğin, 4208 sayılı Karaparanın Aklanmasının Önlenmesine Dair Kanun m.7 uyarınca karapara aklama suçu fiilleri tüzel kişilik bünyesinde işlendiğinde tüzel kişiler hakkında (idari) para cezasına hükmolunur. 213 Sayılı Vergi Usul Kanunu m.333 uyarınca, tüzel kişilerin idare ve tasfiyesinde Vergi Kanununa aykırı hareketlerden doğacak vergi cezaları tüzel kişiler adına kesilir. 4458 Sayılı Gümrük Kanunu m.3’de tüzel kişilerin bu Kanun kapsamında kişi kavramına dahil olduğu gösterilmekte ve m.229’da tüzel kişinin belli hallerde gerçek kişilerle birlikte gümrük idaresince alınan vergiler ile verilen para cezaları yönünden müteselsilen sorumlu oldukları gösterilmektedir. Öte yandan, 5070 Sayılı Elektronik İmza Kanunu m.19’a göre, idari nitelikteki suçların tekrarı halinde elektronik sertifika hizmet sağlayıcıları hakkında kapatma cezası verilmesi öngörülmektedir. VIII. Avrupa İnsan Hakları Sözleşmesine Göre Konunun İrdelenmesi Şirketler insanların yaşama hakkını, sağlık hakkını ihlal edecek faaliyetlerde bulunmamalıdır. Bunun için idarenin denetimi gerekir. Bir yerdeki madencilik faaliyetlerinin kamu yararıyla bağdaşıp bağdaşmadığı konusunun denetlenmesi gibi. Avrupa İnsan Hakları Mahkemesi içtihatlarından anlaşılan şudur: Şirketlerin faaliyetlerinin insan haklarını ihlal etmemesi ve kamu yararıyla bağdaşması konusunda ulusal organların, kurumların veya yetkililerin Avrupa İnsan Hakları Sözleşmesi’nden kaynaklanan sorumluluğu bulunmaktadır. Denetlemeyi ulusal organlar yapmalıdır. Avrupa İnsan Hakları Mahkemesi kararlarında, eski hale getirme ve zararın giderilmesi prensibine dayanılmaktadır12 . Taşkın ve diğerleri/Türkiye (2004) davasında Avrupa İnsan Hakları Mahkemesi idare mahkemesinin yaşam ve çevre hakkına dayanan iznin kamu menfaati ile bağdaşmadığına dair kararına rağmen yürütme organının Bergama’daki madenin çalışmasına izin vermesi dolayısıyla Avrupa İnsan Hakları Sözleşmesi 8. maddenin ihlal edildiği sonucuna ulaşmıştır. Ayrıca kararın makul sürede ve gerektiği şekilde uygulanmaması Avrupa İnsan Hakları Sözleşmesi m.6/1’in ihlali olarak görülmüştür. Bireylerin esenliğini etkileyen, özel ve aile yaşamına zarar verecek derecede bir yerde ikamet etme hakkından onları yoksun bırakan ciddi çevresel saldırıların sözkonusu olması halinde ise Avrupa İnsan Hakları Mahkemesi Avrupa insan Hakları Sözleşmesi m.8’i uygulamaktadır13 . Karadenizin yeşil yolu davasında doğa alanlarının ticarileştirilmesine dönük kolaylaştırıcı mevzuat düzenlemesi yapıldığı iddia edilmektedir. Konuya ilişkin yürütmeyi durdurma kararları bulunmaktadır14 . Artvin Cerattepe’de madencilik faaliyeti yapılmasına karşı çıkılmış, yerel mahkeme Çevre Etki Değerlendirmesi (ÇED) raporunu iptal etmiş, ancak İdare firmaya yeni ÇED raporu vermiştir15 . Bu uygulamalar kamu otoritesinin keyfi müdahaleleri olarak Avrupa İnsan Hakları Mahkemesi önüne gitmeye adaydır. Anayasa Mahkemesi bireysel başvuru üzerine, Ay m.17’de güvencelenen “maddi ve manevi varlığın korunması ve geliştirilmesi hakkının” ihlal edildiğine karar vererek, Rize Kalkandere’deki Cevizlik Hidroelektrik Santralı davasının yeniden görülmesini kabul etmiştir. Yüksek Mahkeme ayrıca ÇED olumlu raporu alınmadan projenin yapılmasını ve Rize İdare Mahkemesinin de bu konuda açılan davayı red etmesini ihlal saymıştır16 . Soma maden ocağındaki faciaya ilişkin dava ise henüz görülmektedir17 . IX. Sonuç Günümüzde tüzel kişiler ekonomik ve sosyal yaşamın ayrılmaz parçaları haline gelmiştir. Devletin bunların faaliyetlerinden kaynaklanacak olumsuz sonuçların etkilerinden bireyleri koruma yükümlülüğü bulunmaktadır. Örneğin, çevre kirliliği sağlık hakkını ihlal eder. Kötü çalışma koşulları insanlık dışı ve onur kırıcı muamele sayılır. Bunlar şirketlerin faaliyetleri dolayısıyla sık sık karşımıza çıkacak olan ihlallerdir. Devlet bu koruma görevini şirketlerin faaliyetleri konusunda hukuk kuralları oluşturmakla, faaliyetlerin denetlenmesini sağlamakla ve ihlaller yapılması halinde de yaptırım uygulanmasını öngörmekle gerçekleştirir. Suç tanımları, bireylere bu tanımlarda yer alan eylemlerin yapılmasının yasak olduğu mesajını verir. Yaptırım uygulanması ise failin tekrar suç işlemesini önleme, yani ıslah etme ve potansiyel failler açısından ibret teşkil etme işlevini görür. Tekrar suç işlemeyi önleme amacı gerçek kişiler üzerinde etkili olur. Tüzel kişiler açısından ise cezanın ancak önleme ve caydırma işlevinden söz edilebilir. Şirketlere yaptırım uygulanması bu tüzel kişilerin organlarının, temsilcilerinin, onlar adına iş görenlerin daha dikkatli olmalarına ve şirket adına hareket edecek kişilerin de daha özenli seçilmelerine yarar. Tüzel kişilerin günümüzde toplumsal ve ekonomik yaşama katılım boyutları gözönüne alındığında bunlara karşı yaptırım uygulanması kaçınılmaz olmaktadır. Yukarıda da değinildiği üzere, hukukumuzda tüzel kişiler suç faili sayılmamakta, organları veya temsilcileri tarafından işlenen belli suçlar dolayısıyla sadece özel hukuk tüzel kişisi hakkında güvenlik tedbiri uygulanabilmektedir. Belli suçlar arasında bir şirket adına işlenmesi ihtimali öngörülen suçlarla aynı veya daha yüksek olan ve ayrımcılığa karşı bireyleri korumak gibi bir hukuki değeri hedefleyen “iş ve çalışma hüriyetinin ihlali” (TCK m.117), “sendikal hakların kullanılmasının engellenmesi” (TCK m.118) ve “nefret ve ayrımcılık” (TCK m.122) gibi suçların yer almamış olması önemli bir eksikliktir. Öte yandan, Türk Ceza Yasası’nda sadece özel hukuk tüzel kişilerine yaptırım uygulanması öngörülerek kamu tüzel kişileri ile özel hukuk tüzel kişileri arasında ayırım yapılması, kanun önünde eşitlik ilkesine aykırı olmaktadır. Çünkü her iki tüzel kişilik türünde de suç ancak tüzel kişinin organı veya temsilcisi olan kişiler tarafından işlenebilir. Organ veya temsilcisinin, kamu tüzel kişisi yararına suç işlemesi de olanaksız değildir. Buna rağmen, kamu hukuku tüzel kişisine güvenlik tedbiri şeklinde bir yaptırım uygulanamayacaktır. Özel hukuk tüzel kişileri hakkında uygulanabilecek güvenlik tedbirleri 5237 sayılı TCK m.60’a göre, “kamu kuruluşlarınca verilen faaliyet izninin iptali” ile “müsadere” olmaktadır. Tüzel kişilere uygulanacak yaptırımlar arasında “adli para cezası” bulunmamaktadır. Ancak, bu durum tüzel kişiler hakkında etkili yaptırım eksikliğine sebebiyet vermiştir. Bu nedenle, 2009 yılında 5326 sayılı Kabahatler Kanunu m.43/A’da bazı suçlardan dolayı özel hukuk tüzel kişileri hakkında idari para cezasına hükmedilmesi öngörülmüştür. Bu durum suç dolayısıyla şirketler hakkında para cezası uygulanmasının çağdaş gelişmeler doğrultusunda kaçınılmazlığını göstermektedir. Olması gereken, bu sui generis düzenlemenin yerine 5237 sayılı Türk Ceza Kanunu’nda tüzel kişilere adli para cezası ödetilmesinin öngörülmesidir.",
     "Kaynakça": ""
}