{
     "Tip": "Makale",
     "Dergi İsmi": "Gazi Üniversitesi Hukuk Fakültesi Dergisi",
     "Üniversite İsmi": "",
     "Gün": "",
     "Ay": "",
     "Yıl": "2016",
     "Cilt": "20",
     "Sayı": "4",
     "Başlık": "İNSAN HAKLARI HUKUKUNUN İÇTİHADÎ KAYNAKLARI",
     "Title": "CASE LAW AS A SOURCE OF THE HUMAN RIGHTS LAW",
     "Yazar İsmi": [
          "Ayşe ÖZKAN DUVAN"
     ],
     "Danışman İsmi": "",
     "Anahtar Kelimeler": [
          "İnsan hakları",
          "içtihat hukuku",
          "anayasa yargısı",
          "hukuk yaratma",
          "içtihadî kaynaklar"
     ],
     "Keywords": [
          "human rights",
          "case law",
          "constitutional jurisprudence",
          "law sources",
          "creating law"
     ],
     "Özet": "Bu çalışmanın amacı, ulusal ya da uluslararası hukuk kaynaklarının mahkeme kararlarındaki yerini değil, mahkeme kararlarının insan hakları hukuku uygulamasına katkısını değerlendirmektir. Konuya ilişkin literatürde bugüne kadar yer bulmuş çalışmalar çoğunlukla ilgili mevzuatın mahkeme kararlarına etkisini konu etmiştir.  Bu çalışmadaki amacımız ise konuyu tersten ele alarak içtihatların insan hakları uygulamasına etkisini saptamak, bu etkiyi maksimize etmenin getirilerini ortaya koymaktır. Özellikle Türk hukuk uygulamasında insan haklarına yönelik mevzuatın devamlı olarak değiştirildiği, her geçen gün anayasa ve yasa düzeyinde çok sayıda değişiklik gerçekleştirildiği halde, insan hakları uygulamasına ilişkin standartlar, mevzuat değişikliğinden kaynaklanan beklentiyi karşılayamamaktadır. Bu durumda üzerinde çalışılması gereken husus, insan hakları mevzuatının uygulayıcısı olan mahkemelerin içtihatlarının geliştirilmesi konusudur. İkinci bölümde tarihsel süreçte insan hakları hukukunun gelişimine içtihatlarıyla katkıda bulunmuş mahkemelerin deneyimlerinden faydalanmak ve üçüncü ile dördüncü bölümlerde Türk yargısındaki ve uluslararası mahkemelerin içtihatları arasındaki güncel etkileşimi değerlendirmek suretiyle,  içtihat  hukukunun  insan  haklarının  gelişimine  yönelik  katkılarını somutlaştırabildiğimizi değerlendirmekteyiz.",
     "Abstract": "The subject of this article is not about the effects of national or international human rights law sources to the case law, but on the contrary, to evaluate the contribution of the court s decisions to legislation. At the most of the legal publications related to human rights law, there is evaluation about the effects of legislative regulations to the legal practice. Our expectation from this work is by addressing the issues of case law to determine the effect of adverse human rights practices, the effect is to reveal the factors to maximize returns. In particular, Turkish law enforcement of legislations   Yrd. Doç. Dr., İstanbul Üniversitesi Hukuk Fakültesi, Kamu Hukuku, Genel Kamu Hukuku  ABD. Öğretim Üyesi. e-posta: ayse.duvan@istanbul.edu.tr   Yayın Kuruluna Ulaştığı Tarih                   : 15.07.2016   Yayınlanmasının Uygun Görüldüğü Tarih: 01.11.2016 Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 137İnsan Hakları Hukukunun İçtihadî Kaynakları on human rights, which we change permanently at statutory or constitutional level even after the changes in legislation, standards on human rights practice, do not meet expectations arisen from legislative changes. At the second part we have tried to beneﬁ t from the historical judicial experiences of the courts which have contributed to the human rights case law. It must be underlined that development of the case law, which at the same time is a matter of enforcement of human rights legislations, is an important trigger mechanism in the development of human rights law.  At the third and fourth part of the article we beneﬁ ted from the Turkish and international examples to explain the power of the case law on the development in human rights.",
     "Metin": "Temel hak ve özgürlüklerin ulusal ve uluslararası mevzuat hükümleriyle düzenlenmesi geleneksel bir yöntemdir. Ancak anayasa ya da yasalarda yer almayan birtakım hakların, temel hak ve özgürlük düzeyine yükseltilmesi yargısal içtihatlarla da mümkün olabilmektedir.1  Kıta Avrupası sisteminin kabul gördüğü Türk hukukunda, yüksek mahkemeler tarafından verilen içtihadı birleştirme kararları dışındaki mahkeme kararları hukukun asli (bağlayıcı) kaynakları arasında yer almamaktadır. Bu nedenle bir mahkeme belirli bir konuda vermiş olduğu bir kararı, aynı konuda yeniden dava açılması halinde tekrarlamak yükümlülüğü altında değildir. Kara Avrupası sisteminde ve Türk hukukunda mahkeme kararları tali (bağlayıcılığı bulunmayan) kaynak olma vasfındadır.2  Bu nedenle Türk hukuk uygulamasında Yargıtay ve Danıştay gibi yüksek mahkemelerin içtihatları bile diğer mahkemelerde ancak takdiri delil kategorisinde değerlendirilmektedir. Kara Avrupası sistemine mahsus olan, içtihatların bağlayıcılık taşımaması durumu, Anglo-Sakson hukuk sistemindekinin aksine hukukun güncellenmesini kolaylaştırmak gibi bir netice doğurmaktadır. Öte yandan benzer hukuksal uyuşmazlıklara ilişkin aynı mahkemenin ya da farklı mahkemelerin benzer kararlar çıkartmaması halinde bu sistem bir tür hukuksal 1 İbrahim Kaboğlu, Özgürlükler Hukuku: İnsan Haklarının Hukuksal Yapısı, Afa Yayıncılık, İstanbul 1998, s. 65; Pertev Bilgen, İdare Hukuku Dersleri: İdare Hukukuna Giriş, Filiz Kitabevi, İstanbul 1999, s. 46. 2  Şeref Gözübüyük, Hukuka Giriş ve Hukukun Temel Kavramları, Turhan Kitabevi, Ankara 2013, s. 57-58. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 139 belirsizlik oluşturma potansiyelini bünyesinde barındırmaktadır. İşte bu yüzden Kara Avrupası sisteminde yargı mercilerinin benzer uyuşmazlıklarda benzer hukuksal çözüm yolunu izleyerek hüküm kurmaları şeklinde bir gelenek oluşmuştur. Daha önce verilmiş mahkeme kararlarından benzer olaylarda faydalanma geleneği içtihat hukukunu oluşturmaktadır. Ülkemizde özellikle derece mahkemeleri yüksek mahkemelerin kararlarına itibar ederek benzer olaylarda benzer kararlar çıkartmaya eğilim göstermektedir.3  Ancak insan hakları hukuku söz konusu olduğunda, derece mahkemelerinin Avrupa İnsan Hakları Mahkemesi içtihatlarını izleyebilmesini sağlayacak teknik programlar geliştirildiği halde, henüz Avrupa İnsan Hakları Sözleşmesi ile gelişen standartları yakalamada yeterli olunamadığı görülmektedir. Bu noktada Türk hukukundaki uygulayıcıların pozitif hukuk anlayışına sadık kalmasının etkisi ve bu alanda yürütülen çalışmaların yetersizliği gibi nedenlerle yargısal kararların, insan hakları hukukunun içtihatlarla beslenmesindeki işlevini güçlendirme ihtiyacı ortaya çıkmaktadır. 1. İçtihadî Kaynakların Niteliği ve Bağlayıcılığı Sorunu Roma hukukundan köklerini alan Batı hukukunun içtihat hukuku olarak gelişim tarihi onuncu yüzyıla kadar gidebilmektedir. Hukuksal bir kararı ortaya koyabilmek için önceki davalarda verilen kararların esas alınması geleneğinin doğmasıyla Roma hukukunun yazılı yasa geleneğinden uzaklaşılmış ve içtihat hukuku gelişmeye başlamıştır.4 İçtihadın kelime anlamı örnek alınan mahkeme kararıdır. Başka bir deyişle içtihat, mahkemeler tarafından somut hukuksal uyuşmazlığı çözümleme izlenen yolu ve ulaşılan sonucu ifade etmek üzere kullanılan bir kavramdır. Yargı mercilerinin benzer uyuşmazlıklarda aynı çözüm yolunu izleyerek benzer kararlar çıkartması bir tür yargı geleneği ortaya çıkartmaktadır. Bu geleneğin devamlılık arz etmesiyle birlikte yargıya güven ve adalete inanç seviyesinde artış olması beklenir. Ancak yargı kararlarının bağlayıcı olup olmaması ya da hukuka kaynak olma değeri bulunup bulunmaması hususunda aksi görüşler de mevcuttur. İçtihat hukukunu kaynak olması bakımından değerlendirebilmek için öncelikle Kara Avrupası Hukuku ve İngiliz Hukuku ayrımını bilmek gerekmektedir. Bu ayrım on dokuzuncu yüzyıldan önce kesin sınırlara sahip olmamış, Kara Avrupası Hukuku ile İngiliz Hukuku arasındaki farklılıklar 3  Fırat Gedik- Emel Koç, “Hüküm Kurma ve İçtihat”, Ankara Barosu Dergisi, Yıl 67, Sayı 2, Bahar 2009, s. 159. 4  Hagen Schulze, Avrupa’da Ulus ve Devlet, (Çev.) Timuçin Binder, Literatür Yayıncılık, İstanbul 2005, s. 16. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 140 henüz biçimlenmemiştir.5 İki sistem arasındaki farklılıklar oluştuktan sonra ise İngiliz hukukunun güncellenme ihtiyacını karşılamak üzere doğal olarak Kara Avrupası hukukuyla etkileşim içine girdiği belirtilmektedir.6  Bu konunun çalışmamız açısından önemli olan boyutu daha çok yargı kararlarının iki sistem içerisindeki konumu, hukuka kaynak olma değerinin düzeyidir. Dolayısıyla bu bölümde sistemleri kısaca tanıttıktan sonra ağırlıklı olarak içtihatların ne şekilde hukuka kaynaklık ettiği hususu üzerinde durulmaktadır. İngiliz Hukuku, Anglo-Sakson Hukuku ya da Anglo-Amerikan Hukuku (Common Law) olarak adlandırılan sistem İngiltere’de doğmuş olup, Amerika Birleşik Devletleri, Kanada, Avustralya ve bazı eski İngiliz sömürgesi devletlerde uygulanmaktadır. Bu sistemde hukuk kuralları tedvin edilmediğinden hukuk, örf ve adet kuralları, mahkeme kararları ve çeşitli kanunlardan oluşmaktadır. Kara Avrupası sisteminde olduğu gibi düzenlenmiş kanunlar bulunmamaktadır. Kıta Avrupası hukukunun temel unsuru olan kamu hukuku-özel hukuk ayrımı da yoktur. Hukuk bütün dallarıyla tek bir alanı ifade etmekte olup, özel kişiler arasındaki uyuşmazlıklar ile devletle özel kişiler arasındaki uyuşmazlıklar ortak kurallara tâbidir. Buna bağlı olarak Türk hukukunda olduğu gibi her yargı kolunun kendi yüksek mahkemesi de bulunmamaktadır. İngiliz hukukunun en karakteristik özelliği içtihadî bir hukuk sistemi olmasıdır. Common Law, Ortaçağ’dan itibaren tekamül etmekte olan mahkeme kararlarıyla vücut bulmuş bir hukuk sistemidir. Bu sistemin geçerli olduğu ülkelerde yargı mercilerinin kararları kesin hüküm niteliği taşımasının ötesinde yasa gücünde kabul edilmektedir. Yargı organları verdikleri kararlarla hukuk yaratmaktadır. Bu bağlamda uygulayıcıya kolaylık sağlamak üzere yargı organı kararları reports denilen kitapçıklarda toplanmaktadır. Kara Avrupası hukuk sisteminde hukukun temel kaynağını yazılı yasalar oluşturmaktadır. Tedvin edilmiş kanunlar hukukun birincil ve bağlayıcı kaynağı olup, mahkemeler kanunlara uygun şekilde karar vermekle yükümlü kılınmıştır.7  Hukukun yenileştirilmesi ihtiyacı yasa koyucunun yasama işlemleri aracılığıyla karşılanmakta, yargı kararları ise tarafl arı dışında bağlayıcı nitelikte olmayan ikincil nitelikte hukuk kaynağı olarak kabul edilmiştir. Prensip olarak bir mahkeme kararı, kararı veren mahkemenin 5  R. H. Helmholz, “Continental Law and Common Law: Historical Strangers or Companions”, Duke Law Journal, Cilt 39, Sayı 6, Aralık 1990, s. 1208. 6  R. H. Helmholz, a.g.m., s. 1228. 7  Fırat Gedik- Emel Koç, a.g.m., s. 158. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 141 kendisini, üst mahkemenin verdiği bir karar da alt mahkemeyi bağlamamaktadır. İngiliz hukukunda kabul olunanın aksine, belirli bir hukuksal uyuşmazlık hakkında karar veren mahkeme, benzer bir olayda tamamen farklı bir karar verebilmektedir. İlk derece mahkemeleri de üst derece mahkemelerinin aynı uyuşmazlıkta verdiği kararı izlemeyebilmektedir. 8 Ülkemizde de benimsenen Kara Avrupası hukuk sistemine göre, verilmiş bir mahkeme kararı, sonraki yargılama süreçlerinde ya da başka davalarda ne kararı veren mahkemenin kendisini, ne de diğer mahkemeleri bağlayıcı etkiye sahip değildir. Yasal düzenleme bu yönde olmasına karşın, mahkeme kararlarının hukuk gelişimine hizmet eden içtihat hukukundan faydalanmak ya da takdiri delil olarak değerlendirmek üzere uygulamada içtihat hukukuna başvurdukları bilinmektedir. Hatta Türkiye’de uygulayıcıların erişimine sunulmak üzere gerek ulusal yüksek mahkemeler ve anayasa mahkemesi, gerekse AİHM içtihatlarının derlendiği çok sayıda elektronik program üretilmiştir. Bu anlamda içtihat hukukunun teşkil ettiği birikimden faydalanma noktasında İngiliz Hukuku ile Kıta Avrupası Hukukunun birbirine belirli düzeyde yaklaştığını ifade edebiliriz. Her iki sistemde de yargı kararlarının bağlayıcı olması ya da olmamasına ilişkin spesifi k konularda tartışmalar mevcuttur. Ancak konuya insan hakları hukuku cephesinden bakıldığında herhangi bir sistemde içtihat hukukunun, bağlayıcı olsun ya da olmasın insan hakları hukukunun gelişiminde çok büyük rolü olan kaynaklar arasında yer aldığı sabit olmaktadır. 9 2. Ulusal Mahkemelerin İçtihadî Kaynaklara Katkısı İçtihat hukukunun gelişim tarihi onuncu yüzyıla kadar götürülebilse de insan hakları hukukunda içtihatların kaynak değeri kazanmasının on sekizinci yüzyılın sonunda gerçekleştiği kabul edilmektedir. Bu tarih diliminde içtihatlarıyla insan hakları hukukuna kaynak oluşturan mahkemeler belirli ülkelerde ön plana çıkmıştır. İlk tarihsel örneklerinden başlamak gerekirse Amerikan ve Fransız devrimlerinin ardından kurulan Amerikan Yüksek Mahkemesi ve Fransız Anayasa Konseyi’nin temel alınması gerekmektedir. Ardından İsviçre Federal Mahkemesi, Alman Federal Anayasa Mahkemesi ve Türk Anayasa Mahkemeleri ele alınabilir.10 Britanya’da ise common law 8  Kemal Gözler, Genel Hukuk Bilgisi, Ekin Basım Yayın Dağıtım, Bursa 2008, s. 5. 9  Javaid Rehman, International Human Rights Law: A Practical Approach, Longman, England 2003, s. 21. 10 İbrahim Kaboğlu, Özgürlükler Hukuku: İnsan Haklarının Hukuksal Yapısı, Afa Yayıncılık, İstanbul 1998, s. 44. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 142 içtihadî hukuku, temel hakların başlıca kaynağıdır. Tekil bir yargı teşkilatının bulunmaması nedeniyle İngiltere bağımsız bir çalışma konusu olarak ele alınabilir. 2.1. Amerikan Yüksek Mahkemesi Kararları Amerikan Yüksek Mahkemesi (Supreme Court), kuruluşundan bu yana içtihatlarıyla kişi hak ve özgürlüklerinin geliştirilmesi ve korunmasında önemli bir rol üstlenmiştir.11 Mahkeme’yi bu rolü üstüne almaya iten nedenlerden biri, 1787 tarihli ilk Amerikan Anayasasının özgürlüklerin sınırlandırılmasına ilişkin hükümler içermemesi olabilir. İlk anayasa metni yedi maddeden ibaret oldukça özet hükümlerden oluşmaktaydı. Amerikan Yüksek Mahkemesi 1789 yılında çıkarılan Adalet Yasası (Judiciary Act) ile kurulmuştur.12 1790 yılından itibaren faaliyete geçen Mahkeme, anayasal yargı denetimi, özgürlüklerin sınırlanmasındaki ölçütler ve yargı denetiminin meşruiyet sınırları gibi hususlarda ilkleri gerçekleştiren içtihatlarıyla dikkat çekmiştir. Mahkemenin sistemdeki yerini güçlendiren başat faktör, 1787 Anayasası’nda düzenlenmediği halde Mahkeme’nin yasaların anayasaya uygunluk denetimi yetkisini kendinde görmüş olmasıdır. Amerikan Yüksek Mahkemesi kendi yetki alanını genişletici mahiyette içtihat üreterek anayasa yargısı denetimini kendi görev alanı bünyesine eklemiştir. Yüksek Mahkeme’nin bu doğrultudaki içtihadına dayanak olarak 1787 Anayasası’nın 6. maddesini gösterenler bulunmakla birlikte; hukukun genel ilkelerini içtihadın dayanağı olarak değerlendirenler çoğunluktadır. İçtihat hukukuyla sağlanan bu gelişme daha sonraki tarihlerde anayasa hükümlerine yansıyacaktır. Ancak hukuksal dayanaklara ilişkin tartışmanın neresinde yer alınırsa alınsın, gelinen noktada 1803 yılında Marbury v. Madison davası 13 sonucunda oluşturulan içtihatla Yüksek Mahkeme’nin anayasal yargı denetimi yetkisine sahip olduğu hususu devam eden yıllarda itiraz konusu edilmemiştir.14 Mahkeme hükmünün oybirliğiyle tesis edildiği Marbury v. Madison davasının yargıcı olan Yüksek Mahkeme başkanı John Marshall anayasaya uygun olmayan bir yasanın, anayasaya uygun olan yasalar gibi geçerli sayılmaması gerektiğini belirtmiştir. Marshall mahkemenin bu tür bir yasayı uygulamaya 11 Şeref Ünal, “İnsan Haklarının Tarihi, Felsefi ve Hukuki Temelleri”, Ankara Barosu Dergisi, Sayı 1, 1994, s. 52. 12 Charles Warren, “New Light on the History of the Federal Judiciary Act of 1789”, Harvard Law Review, Cilt 37, Sayı 1, Kasım 1923, ss. 49-132. 13 Marbury v Madison, 5 U.S. 137, 2 L.Ed. 60 (1803). 14 Cem Eroğul, Çağdaş Devlet Düzenleri, Seçkin Yayıncılık, Ağustos 2014, s. 159. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 143 zorunlu tutulamayacağını, hatta böyle bir durumda anayasaya uygunluk açısından yargısal denetimin bir hak olmanın ötesinde bir görev olduğunu vurgulamıştır.15 Yargıç Marshall anayasaya aykırı yasaların yasama organı tarafından çıkartılması halinde hukukun ne olacağını belirleyecek olanın yargı organı olduğunu savunmuş ve tüm dünyada kanunların anayasaya uygunluğunu denetleyen bir sistemin kurulması yolunu açmıştır.16 Mahkeme yargıçlarının uygulayacakları normların Anayasal çerçeveye uygun olup olmadığını denetlemesini yetki ve yükümlülük olarak değerlendiren daha geç tarihli bir başka karar da United States v. Butler kararıdır.17 Aynı görüşten yola çıkarak davanın yargıcı olan Owen Roberts Amerikan vergi yasasının anayasal ilkelere aykırılığına hükmetmiştir. Yargıç Marshall’ın hükmüyle başlayıp Federal Yüksek Mahkeme’nin benzer içerikteki diğer içtihatlarıyla gelişen anlayış, yasama işlemlerinin anayasal ilkelere uygunluğunu tetkik etmeyi yargı erkinin işlevi olarak değerlendirmiştir.18 Marshall’ın bu görüşü, parlamento tarafından çıkarılan yasaların bir başka organ tarafından denetlenebilmesine dönük kapıları açan bir anlayışa dayanmaktaydı. Bu nedenle dönemin Kıta Avrupası’nda kabul görmekten uzak olmuştur. Dönemin Avrupasında hâkim olan anlayış, J. J. Rousseau’nun ortaya koyduğu genel iradenin üstünlüğü anlayışını ve bu iradenin tercihlerinin esas olduğunu kabul etmekteydi.19 Genel iradenin ya da parlamentonun üstünlüğü ilkesinden beslenen hukuk anlayışı dolayısıyla yargı içtihatlarının hukuk kaynakları arasına girmesi Avrupa ülkelerinde daha geç bir dönemde gerçekleşmiştir. Avrupa toplumları yaşanan dünya savaşlarının ardından yasama iradesinin üstünlüğü görüşünden ödün vermeye hazır olabilmiştir. Yasama işlemi olan kanunların yargısal denetimini yapmakla yetkili mahkemeler olarak ilk kurulanlar, Çekoslovakya Anayasa Mahkemesi, 15 Alpheus Thomas Mason-Donald Grier Stephenson, American Constitutional Law: Introductory Essays and Selected Cases, Prentice Hall, New Jersey, 1990, s. 32-33; Yılmaz Aliefendioğlu, Anayasa Yargısı ve Türk Anayasa Mahkemesi, Yetkin Yayınları, Ankara 1996, s. 41; Ergun Özbudun, Türk Anayasa Hukuku, Yetkin Yayınları, Ankara 1995, s. 343. 16 William M. Beaney, American Constitutional Law: Introductory Essays and Selected Cases, Prentice-Hall İnc., New Jersey, 1964, s. 13; Serap Yazıcı, “Ulus Devletten Ulusüstü Devlete Geçişte Hukuk Devleti”, Ankara Üniversitesi Hukuk Fakültesi Dergisi, Cilt 54, Sayı 4, Ankara 2005, s. 83. 17 United States Supreme Court, U.S. v. Butler, No: 401, 06.01.1936. 18 Hasan Tunç, Karşulaştırmalı Anayasa Yargısı (Denetimin Kapsamı ve Organları), Yetkin Yayınları, Ankara 1997, s. 93; Alpheus Thomas Mason-Donald Grier Stephenson, American Constitutional Law: Introductory Essays and Selected Cases, Prentice Hall, New Jersey, 1990, s. 233-234. 19 Yılmaz Aliefendioğlu, a.g.e., s. 41. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 144 Jellinek ve Kelsen’in de görüşlerine dayanılarak geniş yetkilerle göreve başlatılan Avusturya Anayasa Mahkemesi, Liechtenstein ve İspanya Anayasa Mahkemeleridir.20 İçtihatlarıyla insan hakları hukukuna katkılar sunan Amerikan Yüksek Mahkemesi, ortaya koyduğu bazı kararlarla temel hak ve özgürlükleri sınırlandırmada başvurulacak ölçütleri belirlemiştir. Amerikan Yüksek Mahkemesi’nin temel hak ve özgürlükler yönünden gerçekleştirdiği en önemli katkılardan biri, ifade özgürlüğü ile ilgili sınırlandırmanın, anayasayı yorumlama yetkisine sahip olarak ancak kendisi tarafından verilecek yargısal bir kararla mümkün olabileceğini öngörmüş olmasıdır.21 İfade özgürlüğüne ilişkin sınırlandırma ölçütlerinden Amerikan Yüksek Mahkemesi tarafından ortaya konulanlar içinde ilki Yargıç Holmes tarafından 1919 yılında dile getirilmiştir. Holmes’un Schenck v. United States davasında22 ifade ettiği görüşe göre ifade özgürlüğü ile ilgili davalarda değerlendirmeye esas alınacak öncelikli kriter, “ifadelerin açık ve mevcut bir tehlike yaratacak şekilde kullanılıp kullanılmadığı”dır.23 Bu kıstas dışında özgürlüklerin sınırlarını belirleme hususunda Yüksek Mahkemenin geliştirdiği diğer ölçütler arasında zararlı eğilim ölçütü, mutlak koruma kriteri ve menfaatleri dengeleme gibi ölçütler de yer almaktadır.24 Özgürlükleri sınırlandırmada nazara alınacak kriterleri somutlaştırmış bulunması Yüksek Mahkeme’nin Amerikan devlet düzenindeki konumunu güçlendirmiştir. Amerikan Yüksek Mahkemesi’nin insan hakları hukukuna kaynaklık eden içtihatları daha erken tarihlerde üretilmişken, Avrupa ülkeleri özellikle İkinci Dünya Savaşı sonrası dönemde, insan hak ve özgürlüklerinin korunmasında yargısal denetimin rolünü güçlendirmeye yönelmiştir. Yüz yılı aşkın bir zamanlama farkıyla birlikte içtihatlarıyla insan hakları hukukunun gelişimine katkıda bulunan güçlü bir Avrupa mahkemesi Fransız Anayasa Konseyi olmuştur. 20 Yılmaz Aliefendioğlu, a.g.e., s. 42. 21 İlyas Doğan, İnsan Hakları Hukuku, Astana Yayınları, Ankara, Eylül 2015, s. 98-99; Lawrence Baum, “The Supreme Court in American Politics”, Annual Review of Political Science, Cilt 6, Haziran 2003, ss. 161-180. 22 Schenck v United States, 249 U.S. 47, 52, (1919). 23 Ayferi Göze, Siyasal Düşünceler ve Yönetimler, Beta Yayınları, İstanbul 2013, s.576; Elisabeth Zoller, “The United States Supreme Court and the Freedom of Expression”, Indiana Law Journal, Cilt 84, Sayı 885, Yıl 2009, s. 908. 24 İlyas Doğan, a.g.e., s. 99-100. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 145 2.2. Fransız Anayasa Konseyi Kararları 1958 Fransız Anayasasıyla kurulan Anayasa Konseyi’nin (Constitutional Council) kuruluşundaki gecikmenin nedeni, 1789 ihtilâlcilerinin kanunların anayasaya uygunluğunu yargısal bir denetime bağlamayı reddetmiş olmalarıdır. Fransız Devrimi’nin parlamento üstünlüğüne dayalı anlayışı doğrultusunda, ihtilalciler daha anayasayı bile yapmadan, 1790 tarihli kanunla mahkemelerin yasama kuvvetine müdahalesini menetmişlerdir. Aynı yasak 3 Eylül 1791 tarihli Anayasa hükümleriyle tekrarlanmıştır. 1848 tarihli Anayasa’nın açtığı İkinci Cumhuriyet devrinde yargısal denetim örneği teşkil eden içtihatlar çıkmaya başlamış, 1875 Anayasasının kabulünden sonra Amerikan modeli yargı denetimi tartışmalarına öncülük eden Hauriou ve Duguit gibi hukukçular defi yoluyla mahkemelerin anayasaya uygunluk denetimi yapabileceğini savunmuştur.25 Ancak bilim insanlarının çalışmalarına rağmen, Amerika’da yargıç Marshall’la başlayıp gelişen anayasaya uygunluk denetimi yolu, Fransız hukukunda İkinci Dünya Savaşı sonrasında kurumsallaşabilmiştir. Yazılı ve sert anayasalı birçok Avrupa devleti, yasama organının milli iradeyi yansıttığı ve yargı organlarına kanunların anayasaya uygunluğunu denetleme yetkisi verilmesinin mahkemeleri milli iradenin üstüne çıkarmak anlamına geleceğini değerlendirmiştir.26 Daha sonra Kelsen’in öncülüğünde kuramsal temelleri atılan model üzerinden gelişen Avrupa tipi anayasa yargısı Fransa’da 1958 yılında kabul edilmiştir. Fransız Anayasa Konseyi 1971 yılında verdiği bir kararla 1946 Anayasasının başlangıç bölümünde geçen hak ve özgürlüklerin anayasal önceliği olduğuna karar vermiştir.27 Dönüm noktası teşkil eden bu kararlarından sonra Konsey, norm yaratma yetkisi kullanarak “anayasal değerde ilkeler” geliştirmiş, böylece geniş bir hak ve özgürlükler kataloğu ortaya koymuştur. Fransız Anayasa Konseyi 1979 yılında verdiği iki ayrı kararında “kuvvetler ayrılığı” ve “kamu hizmetlerinin devamlılığı” ilkelerinin hukukun genel ilkeleri olduğuna hükmetmiştir.28 Konsey, Anayasada yazılı olmayan haklara eşitlik hakkı, grev hakkı, dernek özgürlüğü, katılma hakkı gibi hakları eklemiştir. Konsey, anayasal değerdeki hedefl er kategorisinde 25 Alec Stone,The Birth of Judicial Politics in France: The Constitutional Council in Comparative Perspective, Oxford University Press, New York-Oxford 1992, s. 39 ve s. 227. 26 Ergun Özbudun, Türk Anayasa Hukuku, Yetkin Yayınları, Ankara 1995, s. 341-342. 27 Cem Eroğul, a.g.e., s. 160. 28 Tahsin Fendoğlu, “Uluslararası İnsan Hakları Belgelerinin Uygulanmasında “Bağımsız Ölçü Norm” veya “Destek Ölçü Norm” Sorunu”, Anayasa Yargısı Dergisi, Cilt 17, s. 369. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 146 “düşünce ve kanaatlerin özgür iletişim hakkı” ve “enformasyon iletilmesi özgürlüğü” nü tanımıştır.29 Oluşturduğu içtihat hukukuyla Konsey, 1789 İnsan ve Yurttaş Hakları Bildirgesi hükümleri ve eski Fransız Anayasalarının başlangıç hükümlerini anayasallık blokuna dâhil etmiş, günümüzde temel hak ve özgürlüklerin korunmasındaki en değerli güvencelerden biri haline gelmiştir.30 Belirtmek gerekir ki sadece Anayasa Konseyi değil, Fransız Danıştayı da içtihatlarında, temel hakları doğrudan Fransız Anayasasından değil, genel hukuk ilkelerinden istihraç ederek uygulamıştır.31 Sonraki bölümde görüleceği üzere, hukukun genel ilkelerinden yola çıkılarak temel hakların yorumlanması ya da somutlaştırılması, gerek ulusal gerekse uluslararası yargı düzeyinde tercih edilebilen bir yöntemdir. 2.3. Federal Alman Anayasa Mahkemesi Kararları Alman Anayasa Mahkemesi anayasa hukukunu anayasa metniyle sınırlı olarak yorumlamayan, yazılı olmayan anayasa hukukunu kabul eden bir başka mahkemedir. Önemle hatırlatmak gerekir ki prensip olarak Alman hukuk anlayışında anayasa yargısı yoluyla hukuk yaratma söz konusu değildir. Çünkü Alman hukukunda mahkemelerin kural koyma yetkilerinin bulunmadığı kabul edilmektedir. Ancak temel hakların geliştirilmesi söz konusu olduğunda mahkemeler mevcut temel hakların geliştirilmesi yönünde kararlar çıkartabilmektedir.32 Doğal hukuk kökenli olan temel haklar anlayışı, insan eylemine ilişkin her türlü serbestiyi anayasal metinlerle somutlaştırmanın mümkün olmadığını kabul etmektedir. Yargı mercileri aracılığıyla gerçekleştirilen somutlaştırma sayesinde “isimsiz hürriyetler” ya da “örtülü anayasal hak ve özgürlükler” olarak adlandırılan haklar kabul görmüştür.33 Almanya’da Federal Anayasada düzenlenmeyen özgürlükler; Anayasanın 2. maddesinin ilk fıkrasında yer alan ve kapsayıcı özgürlük ya da toplayıcı temel hak olarak “genel bir fi il özgürlüğü” 29 İbrahim Ö. Kaboğlu, a.g.e., s. 67; İbrahim Ö. Kaboğlu, Anayasa Yargısı: Avrupa Modeli ve Türkiye, İmge Kitabevi, Ankara 2000, s. 141. 30 Cem Eroğul, a.g.e., s. 161. 31 A. Füsun Arsava, “ATAD’ın Hukuk Yaratma Yetkisi”, Ankara Üniversitesi Siyasal Bilgiler Fakültesi Dergisi, Cilt 3, Sayı 54, s. 16. 32 Yılmaz Aliefendioğlu, Anayasa Yargısı ve Türk Anayasa Mahkemesi, Yetkin Yayınları, Ankara 1996, s. 176. 33 Muhlis Öğütçü, “Prof. Dr. İrfan Baştuğ Anısına Armağan”, Dokuz Eylül Üniversitesi Hukuk Fakültesi Dergisi, Cilt 7, Özel Sayı 2005, s. 589. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 147 niteliğini kazanan “kişiliğini serbestçe geliştirme hakkı”nın koruma alanı içinde değerlendirilmektedir. Alman Anayasasındaki kişiliği geliştirme hakkına benzer biçimde kapsayıcı özgürlük olarak nitelendirilebilecek bir hüküm de Türk Anayasasının 17. maddesinin birinci fıkrasında düzenlenen “yaşama, maddi ve manevi varlığı koruma ve geliştirme hakkı”dır. Türk Anayasasının “devletin temel amaç ve görevleri” başlıklı 5. maddesinde de, “Devletin temel amaç ve görevleri… insanın maddî ve manevî varlığının gelişmesi için gerekli şartları hazırlamaya çalışmaktır.” Alman ve Türk anayasalarındaki bu hükümler “yazılı olmayan hürriyetler” çatısı altında başka hakları koruma kapsamına almaya müsait bulunan yasal hükümlerdir.34 Federal Alman Anayasa Mahkemesi’ne göre, kişiliğin serbestçe geliştirilmesi hakkı ya da insanın maddi ve manevi varlığını geliştirme hakkı, sadece bireyin kaderini belirleme hakkı ve sadece genel hareket özgürlüğünü değil; aynı zamanda onun içerdiği yetkilerin kullanılmasını da teminat altına alan bir haktır. Mahkemenin anlayışına göre bu hakkın içeriği, devlet iktidarının hukuk devleti şartlarını karşılamayan saldırılarını yasaklamayı kapsamaktadır. Alman Anayasa Mahkemesi kişiliğin geliştirilmesi ilkesini, gerçek kişiler ile yabancılar yanında özel hukuk tüzel kişilerinin de eylem özgürlüğünü teminat altına alacak şekilde geniş kapsamda değerlendirmektedir.35 Kişiliğin korunması ilkesinin bu ölçüde geniş bir koruma çemberi getirmesine bağlanabilecek netice iki yönlü olarak ortaya çıkmaktadır. Birinci yönü kişiliğin korunması ilkesinin temel hak taşıyıcısının kendi yaşamını aktif olarak biçimlendirmesine ilişkindir. İkinci yönü ise devletten gelecek, Anayasaya uygun düzen içinde dayanağı olmayan tecavüzlere karşı özgürlüğün muteber kılınmasıdır.36 Tarihsel sürece bakıldığında anayasa hükümleri arasında yer almayan bir hakkın, insan hakkı olarak anayasal değere sahip olmasını, norm yaratıcı rolü üstlenerek gerçekleştiren merciin genellikle uygulayıcı konumda bulunan Anayasa yargıcı olduğunu görmekteyiz. Nitekim 1949 yılında Frankfurt’ta kurulan Federal Anayasa Mahkemesi’nin, Alman vatandaşları için temel haklarının korunmasında bir güvence kurumu olarak işlemeye başlaması tesadüf değildir.37 Prensip olarak tüm yargıçlar için geçerli olan hukuk 34 Muhlis Öğütçü, a.g.m., s. 590. 35 Zafer Gören, “Türk-Alman Hukukunda Kişiliğin Korunması”, Anayasa Yargısı Dergisi, Cilt 9, Sayı 73, 1992, s. 174. 36 Zafer Gören, , “Türk-Alman Hukukunda Kişiliğin Korunması” , a.g.m., s. 175. 37 Rudolf Mellinghof, “Federal Almanya Cumhuriyeti’nde Anayasa Şikayeti”, Anayasa  Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 148 yaratma zorunluluğu, yorum konusunun özelliği ve kararlarının kapsamlı etkisi dolayısıyla Anayasa yargıcı için öncelikle geçerlilik taşımaktadır.38 Ayrıca bu misyonu üstlenen Alman Anayasa Mahkemesi’nin anayasa şikâyeti mekanizmasının işletilmesi suretiyle verdiği kararların, devlet organları üzerinde eğitici ve önleyici bir etkisi olduğu belirtilmektedir. Bu durum mahkeme içtihatlarının etki gücünü ve otoritesini yansıtan önemli bir göstergedir.39 Mahkeme temel hakları tek tek sıralanmış bir güvenceler dizesi olarak değil, insan onurunun korunması ve kişinin serbestçe gelişimini amaçlayan tutarlı ve boşluksuz bir değerler sistemi olarak yorumlamaktadır. Bu anlayışın izinde ürettiği içtihatlarla Mahkeme, anayasada yer almayan adil yargılanma hakkı, kişiliğin serbestçe geliştirilmesi hakkı, çevre hakkı gibi birtakım hakları yargısal koruma alanına dâhil etmiştir.40 Bu nedenle Alman Anayasa Mahkemesi ülkede hukuk devleti ilkesini ayakta tutan temel direklerden biri olarak anılmıştır.41 Hatta Avrupa devletleri anayasa mahkemeleri içerisinde, en güçlü olanın Federal Almanya Anayasa Mahkemesi olduğu ifade edilmektedir.42 2.4. İsviçre Federal Mahkemesi Kararları 1874 tarihli Federal Anayasasının yüz yılı aşkın bir süre yürürlükte kaldığı İsviçre’de, temel haklar kataloğundaki boşluğun yarattığı alan İsviçre Federal Mahkemesi tarafından değerlendirilmiştir.43 1 Ocak 2000 tarihinde yeni anayasası yürürlüğe giren İsviçre’de, bu tarihten önceki devrede Federal Mahkeme anayasa koyucunun iradesini gözetmek suretiyle, demokratik hukuk devleti anlayışının gereklerini nazara alarak ve anayasal hükümleri güncel ihtiyaçlara göre yorumlayarak yazılı olmayan anayasal haklar tanımıştır.44 Yazısız hürriyetler olarak da adlandırılan söz konusu haklar, İsviçre Federal Yargısı Dergisi, Sayı 26 2009, s. 32; A. Füsun Arsava, “Temel Hakların Alman Anayasa Hukuku Örneğinde, AİHK ve AB İlişkisi Çerçevesinde Yorumu”, Uluslararası Hukuk ve Politika, Cilt 7, Sayı 27, s. 1-2. 38 Zafer Gören, “Siyasal Güç Faktörü Olarak Anayasa Mahkemesi”, İstanbul Ticaret Üniversitesi Sosyal Bilimler Dergisi, Cilt 6, Sayı 14, Güz 2008, s. 3. 39 Rudolf Mellinghof, a.g.m., s. 33; Mehmet Merdan Hekimoğlu, a.g.e., s. 15. 40 İbrahim Kaboğlu, a.g.e., s. 67. 41 Cem Eroğul, a.g.e., s. 202. 42 Hasan Tunç, a.g.e., s. 130. 43 Muhlis Öğütçü, “Doğal Hukuk ve Pozitif Hukuk Işığında İnsan Hakları Alanındaki Bazı Kavramlar”, a.g.m., s. 595. 44 Zafer Gören, Anayasa Hukuku, Yetkin Hukuk Yayınları, Mayıs 2011, s. 360; Muhlis Öğütçü, a.g.m., s. 596. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 149 Mahkemesi tarafından anayasal hükümlerin yetersizliğine cevap vermek üzere içtihatlara sokulmuştur. Oysa aynı anlayışla geliştirilen yazısız hürriyetler Alman Federal Mahkemesi tarafından faşizm döneminin pozitivizmine tepki olarak yorumlanmış ve içtihat hukukunda yer bulmuştur.45 İsviçre Federal Mahkemesi 1874 tarihli mülga İsviçre Anayasasının yürürlükte olduğu dönemde belirlediği sıkı koşullar çerçevesinde kalmaya özen göstererek ihtiyatlı bir yaklaşım benimsemiş, sahip olduğu yargı yetkisinin sınırları içinde kalmayı tercih etmiştir.46 Farklı bir yol izlemiş olsa da sonuç olarak İsviçre Federal Mahkemesi, Anayasa hükümleri içinde yer almayan kişi özgürlüğü, toplanma özgürlüğü, bilgi edinme özgürlüğü, dil özgürlüğü gibi hak ve özgürlüklerin varlığını içtihatlarıyla tanımıştır.47 İsviçre Mahkemesi’nin yazısız hürriyetler kategorisine yaptığı katkılar altmışlı yılların içtihatlarında göze çarpmaya başlamıştır. Federal yargıçlar yazılı olmayan temel hakları İsviçre yazısız anayasa hukukunun bir bölümü olarak kabul etmişlerdir.48 İsviçre hukuku, bilimsel ve yargısal içtihatlar yoluyla “yazısız hürriyetler teorisi”nin geliştirildiği ve temel hakların klasik kaynakları arasına içtihat hukukunun eklendiği anlayışına öncülük etmiştir.49 Bu çerçevede başvurulan yazısız hak tanımında başlıca dört kıstasın nazara alındığı değerlendirilmektedir. İsviçre Mahkemesi’ne göre yazısız hak olabilmenin bir kriteri anayasa metninde sarih şekilde tanınmış bulunan bir başka hakkın kullanılma şartı olması ya da hukuk temeline dayalı demokratik düzenin vazgeçilmez unsuru sayılabilmesidir. 14 Haziran 1970 tarihli Nöthinger kararında Mahkeme, federal ifade hürriyetini siyasi hakların kullanılma koşulu olarak değerlendirmiştir. Bir başka kararında50 yine ifade özgürlüğünü Federal Mahkeme sarih ya da zımni olan diğer özgürlükler gibi kişi varlığını geliştirmede vazgeçilmez bir unsur olarak tanımlamış, hatta demokratik devlet anlayışının temeli olarak kişi özgürlükleri kataloğunda imtiyazlı bir yere sahip olduğunu beyan etmiştir.51 45 Bakır Çağlar, “Anayasa Yargısı ve Normative Devreler Karşılaştırmalı Analizi”, Anayasa Yargısı Dergisi, Cilt 6, 1989, s. 136-137. 46 Muhlis Öğütçü, a.g.m., s. 596. 47 İbrahim Kaboğlu, a.g.e., s. 66-67. 48 Bakır Çağlar, a.g.m., s. 136. 49 Bakır Çağlar, a.g.m., s. 137. 50 Aleinick c. Cour de Justice et Prrocureur du Canton de Geneve, 24.06.1970. 51 Bakır Çağlar, a.g.m., s. 137. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 150 İsviçre Federal Mahkemesi’nin içtihatlarıyla somutlaştırdığı diğer bir kıstas, yazısız hürriyetin ortak bir değerler sisteminin hukuk dilindeki karşılığını oluşturmasıdır. Değerler sisteminden kasıt, tarihsel ve ideolojik değerler birikimidir. Dördüncü ve son kıstas ise yazısız hürriyetin yargılanabilirlik vasfını haiz olmasıdır.52 İsviçre Federal Mahkemesi’nin içtihatları bilimsel çalışmalarla birlikte “yazısız hürriyetler teorisi”nin inşasına öncülük etmiştir. Yazısız özgürlükler hususundaki öncü rolü nedeniyle, Mahkeme “normatif kurucu iktidar” olarak adlandırılmıştır.53 Bununla birlikte anayasa metninde yazılı haklar ile içtihatlarda üretilen yazısız haklar arasında hiyerarşi bulunduğu sonucuna varılabilecek bir kararı nedeniyle Federal Mahkeme eleştiri almıştır.54 1947 tarihli İtalyan Anayasasında temel haklar, ihlal edilemez (dokunulmaz) haklar adıyla düzenlenmiştir. İtalyan Anayasa Mahkemesi bu bağlamda çeşitli kararlarıyla örgütlenme özgürlüğü, seçilme hakkı, evlenme hakkı, savunmayla bağlantılı adli hatanın giderilmesi hakkı, eşitlik ilkesi, insan onuruna saygıyı öngören hakları dokunulmaz haklar kapsamına dâhil etmiştir.55 Ayrıca İtalyan Anayasa Mahkemesi, “ihlal edilemez haklar” deyiminden onur hakkı ve özel yaşam hakkı gibi hakları da çıkartmıştır.56 Bahsi geçen tüm bu örnekler, anayasa yargıcının temel hak ve özgürlükleri koruyucu jürisprüdansını yansıtmaktadır. Anayasa metninde açıkça yer almayan haklar da insan hakkı olarak anayasal değere sahip olabilmektedir. Anayasa yargıcının anayasa hükümlerinin lafzı ile bağlı kaldığı taktirde, denetim yetkisi etkisizleşmektedir. Bu nedenle anayasal kurallara ”kurucu” bir yorumla işlerlik kazandırmak yargıca düşmektedir.57 Dünyadan tarihsel ve güncel örneklerin somutlaştırdığı bu durum anayasa yargıcının norm yaratma işlevinin58 sonucu olarak değerlendirilebilmektedir.59 Yasaların 52 Bakır Çağlar, a.g.m., s. 137. 53 Muhlis Öğütçü, a.g.m., s. 597. 54 Muhlis Öğütçü, a.g.m., s. 598-599. 55 Yılmaz Aliefendioğlu, a.g.e., s. 180. 56 İbrahim Kaboğlu, a.g.e., s. 148. ; Hasan Tunç, a.g.e., s. 107. 57 Bakır Çağlar, “Anayasa Yargısında Yorum Problemi: Karşılaştırmalı Analizin Katkıları”, İstanbul Üniversitesi İdare Hukuku ve İlimleri Dergisi, Cilt 5, Sayı 1-3, 1984, s. 8. 58 Anayasaya uygunluk denetimi sonucunda yasalar “yargıç ürünü hukuk” olarak görülebilmekte, yasama işlemlerinin yasama mensupları ile birlikte yargıçların da yasa yapma sürecine katıldığı ifade edilmektedir; bkz: Yusuf Şevki Hakyemez, Hukuk ve Siyaset Ekseninde Anayasa Mahkemesinin Yargısal Aktivizmi ve İnsan Hakları Yaklaşımı, Yetkin Yayınları, Ankara 2009, s. 25. 59 İbrahim Ö. Kaboğlu, Anayasa Yargısı: Avrupa Modeli ve Türkiye, İmge Kitabevi, Ankara 2000, s. 148. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 151 uygunluğunu yalnızca anayasanın yazılı hükümlerine göre değerlendiren pozitivist anlayışa göre özgürlüklerin kaynağı pozitif hukuk metinleridir. Buna karşın anayasadan çıkarılan yazılı olmayan ilke ve kurallara göre uygunluk denetimini kabul eden natüralist anlayışa göre hak ve özgürlükler anayasa metinlerinde yer almasalar da hukuk düzeninde tanınabilir; çünkü kaynağı hukuk ötesindedir. Buna göre anayasal adalet, temel hakların yargısal koruma aracı olarak yargıçların yaratıcı rolünün büyümesinin görünümü şeklinde vasıfl andırılmıştır.60 Anayasal yargı denetiminin meşruiyet sınırlarının nerede başlayıp nerede bittiği hususunda yapılan çalışmalardan biri John H. Ely’ye aittir. Ely Amerikan Yüksek Mahkemesi’nin 1973 tarihli Roe v. Wade kararını çıkış noktası olarak almıştır. Yargıç White karşı oy görüşünde bu mahkeme kararıyla yeni bir anayasal hak yaratıldığını savunmuştur. Mahkemenin yetki sınırlarını tespite yönelik bir başka çalışma Thomas Gray tarafından gerçekleştirilmiştir. Gray yargı denetimi modellerini “saf yorumcu” ve “yorumcu olmayan” denetim modeli olarak ikili bir ayrıma tabi tutmuş ve yasa koyucunun iradesinin açıklandığı anayasa diline sadık kalınmasını ifade eden “yorumcu olmayan” modeli meşru kabul ettiğini belirtmiştir.61 Bu iki örnek, pozitivist yaklaşımla bağdaşmakta ve anayasa yargıcının rolünün “uygun usul” anlayışıyla sınırlı kalması gerektiğini belirtmektedir.62 Türk Anayasa yargısının da bu argümanlar ekseninde geliştirdiği bir içtihat hukuku mevcuttur. Gerek 1961 Anayasası, gerekse 1982 Anayasası döneminde Anayasa Mahkemesi’nin doğal hukuk anlayışıyla örtüşen gerekçelendirmelere yer verdiği söylenebilir. Modern hukukta anayasa mahkemeleri yorumlama faaliyetleri sonucunda sadece özgürlükleri koruyan ilkeler geliştirmekle yetinmemekte; anayasal değerdeki ilkelerden normlara giderek, norm yaratma yoluyla da insan haklarını zenginleştirmektedirler. Bu bağlamda anayasa hukukunun alanı anayasa metniyle sınırlı olmayıp, kurucu iktidarı da bağlayan supra-pozitif ilkeleri63 de kapsayacak şekilde 60 İbrahim Kaboğlu, a.g.e., s. 149. 61 Bakır Çağlar, “Anayasa Yargısında Yorum Problemi: Karşılaştırmalı Analizin Katkıları”, İstanbul Üniversitesi İdare Hukuku ve İlimleri Dergisi, Cilt 5, Sayı 1-3, 1984, s. 8. 62 “Procedural Fairness” olarak adlandırılan uygun usul anlayışı, anayasa yargıcının yargısal denetimdeki rolünün kapsamını belirlerken usul ve maddi muhteva ayrımı yapmaktadır, bkz. Bakır Çağlar, “Anayasa Yargısında Yorum Problemi: Karşılaştırmalı Analizin Katkıları”, a.g.m., s. 8. 63 Insan haklarına dayalı sistemlerde “supranorm” olarak adlandırılan temel hak ve özgürlüklerin değerler hiyerarşisinin en üstünde yer aldığı kabul edilmektedir; bkz. Mehmet Merdan  Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 152 genişlemiş olarak kabul edilmektedir.64 Almanya, Fransa, İsviçre, İtalya’daki anayasa yargıçları, anayasal ilkelerin içerik ve çerçevesini saptama olanağına ve anayasal hakların genişletilmesi uygulamalarına, başvurdukları yorum faaliyetlerinin katkısıyla sahip olabilmişlerdir. Türk Anayasacılık tarihinde de 1924 Anayasası döneminden başlayarak içtihat yoluyla yasaların yargısal denetimi yolunda çalışmalar yapılmış ve doktriner tartışmalar yaşanmıştır. 3. Uluslararası Mahkemelerin İçtihadî Kaynaklara Katkısı Ülkemizde benimsenen Kara Avrupası hukuk sistemine göre, verilmiş bir mahkeme kararının, sonraki yargılama süreçlerinde ya da başka davalarda ne kararı veren mahkemenin kendisini, ne de diğer mahkemeleri bağlayıcı etkiye sahip olmadığını daha önce de belirtmiştik. Yasal olarak böyle olmakla birlikte, mahkeme kararlarının hukuk gelişimine hizmet edebilen içtihat hukukundan faydalanmak ya da takdiri delil olarak değerlendirmek üzere uygulamada yüksek mahkemelerin içtihatlarına başvurdukları bilinen bir gerçektir. Hatta Türkiye’de uygulayıcıların erişimine sunulmak üzere gerek ulusal yüksek mahkemeler ve anayasa mahkemesi, gerekse AİHM içtihatlarının derlendiği çok sayıda elektronik program üretilmiştir. Uluslararası yargı mekanizmaları arasında da, insan haklarını ilgilendiren uyuşmazlıklarda mahkemelerin kendi bünyelerinde veya birbirleriyle ilişkilerinde, aralarında herhangi bir hiyerarşik ilişki kurmaksızın içtihat hukukunun gözetildiğini söyleyebiliriz. Ancak içtihat hukukunun gözetilmesi ile içtihatların birincil hukuk kaynağı olarak kabul edilmesi arasında önemli bir fark vardır. Kural olarak uluslararası hukukun yargı mercii olarak görev yapan uluslararası mahkemelerin kararları uluslararası hukukun yardımcı kaynaklarından olup tarafl ar dışında bağlayıcı niteliği bulunmamaktadır. Uluslararası hukuk gelişmekte olan nispeten genç sayılabilecek bir hukuk dalıdır. Bu nedenle İngiliz Hukukunda (common law) olduğu gibi, yargı kararları bağlayıcılıklarıyla hukukun birincil kaynağı olarak kabul edilmemektedir. Common Law sistemi, hukukun yasal bir dayanak bulunmaksızın köklü ve istikrarlı biçimde tekâmül arz eden yargı kararlarından beslenmesini ifade etmektedir. Başka bir deyişle bu sistemde yargı organları somut uyuşmazlıkları yargılama sürecinde ele alıp karara bağlarken hukuku Hekimoğlu, Alman Hukuku Işığında Türk Anayasa Yargısının Hukuki Boyutları, Detay Yayıncılık, Ankara 2004, s. 14. 64 Tahsin Fendoğlu, “Uluslararası İnsan Hakları Belgelerinin Uygulanmasında “Bağımsız Ölçü Norm” veya “Destek Ölçü Norm” Sorunu”, Anayasa Yargısı Dergisi, Cilt 17, s. 364. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 153 yaratmış olmaktadır. Yargı makamlarının yargılama işlevini yerine getirirken hukuku yarattığını kabul edebilmek için son derece gelişmiş tarihsel birikime sahip olmaları gerekmektedir. Böyle bir birikimden söz edilemeyeceğinden uluslararası hukukta geçmişteki mahkeme kararları hukukun bağlayıcı kaynağı olarak kabul edilmemiştir. Dolayısıyla uluslararası mahkemelerin yargısal kararları, hukuk kuralı gibi gelecekteki benzer olaylarda uygulanma ya da emsal oluşturma işlevine sahip kılınmamıştır.65 Mahkeme kararlarının yardımcı kaynak olarak kabul edilmesi ve gelişme aşamasında olduğu kabul edilen uluslararası hukuk alanında çok sınırlı sayıda yargı kararı olması bunların önemini azaltmamaktadır. Uluslararası uyuşmazlıkları çözmekle yükümlü yargı organları çoğunlukla daha önceki yargı kararlarını incelemekte ve kendi karar metinlerinde önceki kararlara atıfta bulunabilmektedir. Uluslararası Adalet Divanı’nın kararları ve danışma görüşlerinde, kendi oluşturduğu kural ve ilkeleri uyguladığı, hatta bu ilkelerin daha sonraki uyuşmazlıklarda yapılageliş hukukunun ögesi olarak ya da uluslararası anlaşma hükümleri arasında yer almak suretiyle kaynak değerine sahip olduğu gözlenmektedir. Hatta bazen ulusal mahkemelerin kararları da uluslararası mahkemeler yönünden kaynak değerinde kabul edilebilmektedir. Mesela uluslararası akarsuların kullanımına ilişkin federal yargı kararlarının uluslararası mahkemeler bakımından hukuk kaynağı olarak kabul edildiğine ilişkin örnekler mevcuttur.66 Çalışmamız yönünden esas önem arz eden konu insan hakları hukuku bakımından içtihatların kaynak değeri oluşturmasıdır. Uluslararası hukukta da insan haklarını korumaya yönelik yargısal mekanizmalardan söz açıldığında ilk akla gelen Avrupa İnsan Hakları Mahkemesi’dir. İnsan Hakları Mahkemesi 1975 yılında verdiği Golder kararında67 Sözleşme’nin Başlangıç bölümünde yer alan “hukukun üstünlüğü” ilkesi ve “hukukun genel prensipleri”ne dayanarak “adaletten yararlanma hakkı”nı, Sözleşme’nin 6. madde ilk fıkrasında tanınmış bulunan hakka bağlı bir hak olarak değerlendirmiştir. Mahkeme’nin bu yorumu, normatif bir metin olan İnsan Hakları Sözleşmesi’nin taraf devletlere yeni borçlar yükleyecek genişlikte bir yorum olmadığı gerekçesiyle Mahkeme’nin kendisi tarafından başka bir 65 Yücel Acer- İbrahim Kaya, Uluslararası Hukuk: Temel Ders Kitabı, Seçkin Yayınları, Ankara, Ekim 2015, s. 58-59. 66 Yücel Acer- İbrahim Kaya, a.g.e., s. 59-60. 67 ECHR, Case of Golder v the United Kingdom, App. No. 4451/70, 21.02.1975. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 154 kararında68 desteklenmiştir. Mahkeme adaletten yararlanma hakkını, adil yargı hakkı kapsamında ve 6. maddenin yansıması şeklinde açıklamıştır. Buna karşın, karşı oy görüşünü belirten yargıç Fitzmaurice, Avrupa İnsan Hakları Mahkemesi’nin anti-pozitivist eğilimini eleştirerek, antlaşma hukukuyla ilgili Viyana Konvansiyonu’nun yorum kurallarına aykırılık meydana getirildiğini ve tarafl arın yerine geçerek boşluk doldurulamayacağını savunmuştur.69 Literatürde geniş çapta kabul edilen anlayış, uluslararası mahkeme yargıçlarının yargı faaliyetleri esnasındaki yorumlarının uluslararası antlaşmalar hukukunun tekamülüne hizmet ettiği savına sahip çıkmaktadır. Yargı mekanizmalarının uygulayıcısı konumundaki yargıçların yorumlama faaliyetleri sonucunda uluslararası hukukun kaynağı mahiyetinde kararlar çıkartmasına en ideal örnek olarak Avrupa İnsan Hakları Mahkemesi gösterilmektedir.70 İnsan Hakları Mahkemesi, zengin içtihatlarında insan hakları hukukuna ilişkin bilimsel yayınlar ve diğer yargı kararlarındaki doktrine dayalı gerekçelendirmelerden beslenerek hukuk yaratmıştır. Yukarıda belirttiğimiz 1975 yılına ait Golder kararı bu alanda nirengi noktası olmuştur.71 Ardından AİHM’nin verdiği Loizidou kararı 72, temel hakların korunmasının sözleşme hükümlerinin kırk yıl önceki konuluş şartlarına göre değil günün koşullarına göre yorumlanması suretiyle etkin kılınabileceğini ortaya koymuştur. 1978 Tyrer kararında73 da AİHM yargıçları, Sözleşme hükümlerinin günün koşullarına göre dinamik bir yaklaşımla yorumlanması anlayışını pekiştirmiştir. Kararda Avrupa İnsan Hakları Sözleşmesi yaşayan bir enstrüman olarak tanımlanmış ve güncel yorum yöntemine başvurma Mahkeme bakımından bir yükümlülük olarak değerlendirilmiştir.74 Avrupa Birliği Adalet Divanı da AİHM gibi içtihatlarında temel hakları, Birlik hukukunun genel prensipleri olarak tanımlamakta ve demokrasinin uygulandığı ya da hukukun üstünlüğü prensibinin tanındığı üye devletler ortak 68 ECHR, National Union of Belgian Police v Belgium, App. No. 4464/70 , 27.10.1975. 69 Bakır Çağlar, “Anayasa Yargısında Yorum Problemi: Karşılaştırmalı Analizin Katkıları”, İstanbul Üniversitesi İdare Hukuku ve İlimleri Dergisi, Cilt 5, Sayı 1-3, 1984, s. 18. 70 Daniel Costelloe - Malgosia Fitzmaurice, «Lawmaking by Treaty: Conclusion of Treaties and Evolution of Treaty Regimes in Practice «, Cathrine Brölmann - Yannick Radi (Edit.), Theory and Practice of International Lawmaking, Elgar Publishing, Cheltenham UKNorthampton MA USA, 2016, s. 128. 71 Daniel Costelloe - Malgosia Fitzmaurice, a.g.e., s. 129. 72 ECHR, Case of Loizidou v Turkey, App. No. 15318/89, 18.12.1996. 73 ECHR, Tyrer v United Kingdom, App. No. 5856/72, 25.04.1978. 74 Daniel Costelloe - Malgosia Fitzmaurice, a.g.e., s. 129. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 155 anayasal teamüllerine dayanmaktadır. Hatta AB Adalet Divanı devletlerin taraf olduğu uluslararası antlaşmalara, özellikle de AİHS’ne atıfta bulunarak bu tutumunu gerekçelendirmektedir. Divan, Stauder75, Nold76 ve Hauer77 kararlarında bu tutumunu somutlaştırmış ve daha güçlü bir şekilde ortaya koymuştur.78 ATAD, “Hoechst” kararından itibaren Avrupa İnsan Hakları Sözleşmesi’ni sadece AB üyelerinin ortak anayasa geleneklerinin yorumunda esas almadığını, ortak anayasa gelenekleriyle İnsan Hakları Sözleşmesini kaynak değeri bakımında hiyerarşik olarak eş düzeyde kabul ettiğini ortaya koymuştur.79 Uluslararası yargı mekanizmalarında içtihat hukukuna başvurulmasına ilişkin olarak mevzuat cephesinden örnek vermek gerekirse, Birleşmiş Milletler Uluslararası Adalet Divanı Statüsü’nün80 38. maddesi “d” bendi üzerinde durmak gerekir. İlgili madde hükmünde mahkeme kararlarının hukukun kaynağı olduğu belirtilmiştir. Hangi mahkeme kararlarının kastedildiği açık şekilde belirtilmemekle birlikte mevzuat düzeyinde içtihatların hukukun kaynağı olarak nitelenmiş olması önem arz etmektedir. Ayrıca aralarında hiyerarşik ya da benzeri bir ayrım gözetmeksizin, ulusal, bölgesel ve uluslararası mahkeme içtihatları arasında herhangi bir formda gerçekleşen etkileşimin81 temel hak ve özgürlüklerin korunması alanında hukuksal gelişmeye hizmet ettiği yaygın kabul gören bir husustur.82 Bazı hallerde farklı uluslararası ya da bölgesel örgütler bünyesinde görev yapan uluslararası yargı organlarının birbirlerinin içtihatlarına atıfl arda bulunduğuna tanık olmaktayız. Örneğin Avrupa İnsan Hakları Mahkemesi MC v Bulgaria davasında83 Eski Yugoslavya Uluslararası Ceza Mahkemesi içtihatlarını esas alarak, Avrupa İnsan Hakları Sözleşmesi 3. madde hükmünde düzenlenmediği halde cinsel saldırının işkence eylemi kapsamında 75 EU Court of Justice, Case 29/69, 12.11.1969. 76 EU Court of Justice, Case 4/73, 14.05.1974. 77 EU Court of Justice, Case 44/79, 13.12.1979. 78 Bakır Çağlar, a.g.m., s. 19. 79 A. Füsun Arsava, a.g.m., s. 17. 80 Statute of the International Court of Justice: http: //www.icj-cij.org/documents 81 Konuyla ilgili tartışmalar ve karar örnekleri için bkz: Christopher McRudden, “Common Law on Human Rights: Transnational Judicial Conversation on Constitutional Rights”, Oxford Journal of Legal Studies, Cilt 20, Sayı 4, Kış 2000, ss. 499-532. 82 Christine Chinkin, “Sources”, Daniel Moeckly-Sangeeta Shah-Sandesh Sivakumaran (Der.), International Human Rights Law, Oxford University Press, 2010, s. 115. 83 ECHR, MC v Bulgaria, No: 646, 4 Aralık 2003. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 156 değerlendirileceği sonucuna varmıştır.84 Bu örnekten yola çıkarak tamamıyla farklı hukuk rejimlerinde yargılama yapan iki mahkemenin yargılama usulleri ve içtihatları arasında otomatik bir geçişkenlik bulunduğunu söylemek mümkün değildir. Bununla birlikte birisi ceza yargılaması, diğeri hukuk yargılaması yapan bu iki mahkemenin kararları arasındaki etkileşimden yola çıkılarak, içtihatların insan hakları hukukunun ikincil nitelikte kaynağını teşkil ettiğini net olarak ifade etmek mümkündür.85 AB Adalet Divanı özellikle 1974 yılından sonra verdiği kararlarda AİHS hükümlerine daha sıkça istinat etmeye başlamıştır. Avrupa İnsan Hakları Mahkemesi de Divan’ın bazı kararlarına gönderme yapmaktadır. Ceza yargısında savunma hakkını ilgilendiren uyuşmazlıklar söz konusu olduğunda Uluslararası Ceza Mahkemesi de AİHM’nin sistematiğini uygulamaktadır. Şüpheli veya sanığın savunma hakkına ilişkin olarak AİHM’nin içtihatlarında geliştirdiği standartlar, Uluslararası Ceza Mahkemesi yargısında bire bir yansımasını bulabilmektedır.86 Bu noktada ulusal, bölgesel ya da uluslararası mahkemeler arasında bir hiyerarşi bulunmadığını önemle vurgulama ihtiyacı vardır. Bu şekilde mahkemeler birbirlerinin insan haklarının korunmasına ilişkin kararlarına atıfta bulunarak dolaylı yoldan içtihat hukukuna katkıda bulunmuş, ya da içtihat hukukunun gelişmesine destek vermiş olmaktadır. Uluslararası mahkemeler cephesinde ulusal mahkemeler cephesindeki gelişmelere benzer çerçevede içtihatların insan hakları hukukuna doğrudan doğruya da kaynaklık ettiği görülebilmektedir. Örneğin Avrupa Birliği’nin yargı organı olan Adalet Divanı dinlenme hakkı, aynı suçtan iki kez yargılanmama, eşitlik, orantılılık gibi yazılı olmayan hakları ve ilkeleri içtihatlarıyla benimsemiştir.87 Avrupa Konseyi’nin yargı organı olan Avrupa İnsan Hakları Mahkemesi, içtihatlarıyla çevre hakkını tanımıştır.88 Ayrıca başka uyuşmazlık konularında verdiği kararlarıyla Avrupa İnsan Hakları Mahkemesi kendi içtihat hukukunu geliştirmeye devam etmektedir. Adil yargılanma hakkında yola çıkarak Strazburg Mahkemesi, hakkaniyete uygun şekilde dinlenilme hakkını, mahkeme önünde hak arama özgürlüğünü, susma 84 Christine Chinkin, “Sources”, s. 116. 85 Christine Chinkin, “Sources”, s. 117. 86 Nicolas A. J. Croquet, “The International Criminal Court and the Tratment of Defence Rights: A Mirror of the European Court of Human Rights’ Jurisprudence”, Human Rights Law Review, Cilt 11, Sayı 1, 2011, ss. 91-131. 87 İbrahim Kaboğlu, a.g.e., s. 69. 88 İbrahim Kaboğlu, a.g.e., s. 69. Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 157 hakkını, tarafl ar arasında silah eşitliğini, yargılamada yüz yüzelik gibi hakları içtihatlarıyla Sözleşme’nin koruması kapsamına dâhil etmiştir.89  AB Adalet Divanı yazılı olmayan hukukla çalışmak suretiyle, Avrupa İnsan Hakları Mahkemesi de hukukun genel prensiplerini kullanmak suretiyle hukuk yaratmaktadırlar.90 Buna göre tarihsel süreçte bazı ulusal anayasa mahkemelerinin ortaya koyduğu yazılı olmayan temel haklar kataloğunun kabulüne ilişkin anlayışın uluslararası mahkemeler düzeyinde de destek gördüğü ve yazısız haklar listesinin zenginleştirilmiş bulunduğu anlaşılmaktadır. Doğal hukuk doktrinini yansıtan bu anlayış İsviçre Federal Mahkemesi, Federal Alman Anayasa Mahkemesi, Fransız Anayasa Konseyi ve İtalyan Anayasa Mahkemesi gibi Avrupa mahkemeleri ile Amerikan Yüksek Mahkemesi tarafından kabul görmektedir. Pozitif hukuka üstün temel haklar kavramını kabul etmeyen pozitivist doktrin ise Kelsen’in hukuk teorisinden etkilenen Avusturya Anayasa Mahkemesinde görülmektedir.91 4. Türk Hukukunda İçtihatların İnsan Hakları Hukukuna Katkısı Çalışmamızın başında belirttiğimiz gibi, yargısal içtihatların kaynak olma değeri bir hukuk sisteminden diğerine değişkenlik arz etmektedir. AngloSakson hukuk sisteminin aksine, Kıta Avrupası sisteminin benimsendiği ülkelerde mahkeme kararları hukukun bağlayıcı kaynaklarından değildir. Bu halde yargıçlar sadece yürütme ve yasamaya karşı değil, yargı içinde de bağımsızdırlar. Yargıçlar baktıkları davalarda diğer mahkeme kararlarıyla bağlı olmadan kendi hukuksal anlayışına göre karar verebilirler. Bu ilkenin iki istisnası olan içtihadı birleştirme kararları ve Anayasa Mahkemesi kararları bağlayıcı niteliktedir.92 Amerikan modeli anayasal yargı denetiminin yol kat ettiği, Avrupa modelinin ise henüz ortaya çıkmadığı 1924 Anayasası döneminde, Türkiye’de anayasanın sertliğine dayanılarak somut norm denetiminin mahkemeler tarafından gerçekleştirilip gerçekleştirilemeyeceği tartışmaları yaşanmaya başlamıştır. Türk doktrininde tartışmaların bir cephesinde yer alan hukukçular, Amerikan Yüksek Mahkemesi Başkanı yargıç Marshall’ın Marbury 89 Ergin Ergül, a.g.e., s. 191. 90 Bakır Çağlar, “Anayasa Yargısında Yorum Problemi: Karşılaştırmalı Analizin Katkıları”, İstanbul Üniversitesi İdare Hukuku ve İlimleri Dergisi, Cilt 5, Sayı 1-3, 1984, s. 10. 91 Bakır Çağlar, a.g.m., s. 11. 92 Yüksel Metin, “Türkiye’de Yargı Bağımsızlığına İlişkin Kimi Sorunlar ve Çözüm Önerileri”, Anayasa Yargısı Dergisi, Cilt 27, 2010, s. 224.  Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 158 v. Madison93 davasındaki kararında dayandığı gerekçelerden hareket ederek, mahkemelerin somut norm denetimi yoluyla yasaların anayasaya uygunluğunu denetlemek için açık bir anayasal hükme ihtiyaç bulunmadığını savunmuştur. Diğer bir grup hukukçu ise 1924 Anayasası metnine göre mahkemelere anayasal yargı denetimi yetkisi vermenin mümkün olmadığı görüşünü ileri sürmüştür. Doktrindeki ikilik dönemin mahkeme içtihatlarına da yansımıştır. Derece mahkemelerinin yargısal denetimden yana kararlar vermeye başlamasına karşın, yüksek mahkemeler bu görüşü benimsemediği için yargısal denetim sistemi içtihat yoluyla yerleşememiştir.94 1961 ve 1982 anayasaları döneminde içtihatlarda ve doktrinde yaşanan tartışmaları sonlandıran, anayasal yargı denetimi yetkisinin Anayasa Mahkemesi tekelinde tanınması olmuştur. Anayasa Mahkemesi’ne tanınan anayasa organı statüsü ve bu statünün getirdiği fonksiyonun niteliği Anayasa Mahkemesine yargı organı içinde özel bir konum da kazandırmıştır.95 Türk Anayasa Mahkemesi’nin anayasaya uygunluk denetimindeki işlevi yerleştikten sonra bu kez içtihat hukukunda öne çıkan husus, anayasal yargı denetiminin sınırları konusu olmuştur. Türk Anayasa Yargısı içtihatlarına bakıldığında, gerek 1961 Anayasası, gerekse 1982 Anayasası döneminde Anayasa Mahkemesi’nin doğal hukuk anlayışıyla örtüşen gerekçelendirmelere yer verdiği söylenebilir. 1961 Anayasasından bu yana Türk Anayasa Mahkemesi temel hak ve özgürlüklerin yasama çoğunluğuna karşı en temel güvencelerinden birisi olarak kabul görmüştür.96 Bu işlevsel konumu dolayısıyla modern hukukta anayasa mahkemeleri yorumlama faaliyetleri sonucunda sadece özgürlükleri koruyan ilkeler geliştirmekle yetinmemekte; anayasal değerdeki ilkelerden normlara giderek, norm yaratma yoluyla insan haklarını zenginleştirmektedirler. Doktrinde “somutlaştırma”, “zenginleştirme” ya da “hukuk yaratma” adlandırmasıyla yer alan yargısal yetki kullanma biçimleri, insan hakları hukukuna içtihatlarla katkı yapılmasının yolunu açmıştır. Türk Anayasa Mahkemesi zaman zaman anayasa ya da yasa hükmüne bağlı olarak türevsel bir yetki kullanmak suretiyle yeni bir hak yaratma yoluna gitmiştir.97 Mahkeme’nin bu anti-pozitivist pozisyonu, anayasaya 93 Marbury v Madison, 5 U.S. 137, 2 L.Ed. 60 (1803). 94 Ergun Özbudun, a.g.e., s. 344. 95 Zafer Gören, “Siyasal Güç Faktörü Olarak Anayasa Mahkemesi”, a.g.m., s. 4. 96 Yusuf Şevki Hakyemez, Hukuk ve Siyaset Ekseninde Anayasa Mahkemesinin Yargısal Aktivizmi ve İnsan Hakları Yaklaşımı, Yetkin Yayınları, Ankara 2009, s. 57. 97 Türk Anayasa Mahkemesi’nin, Anayasa hükmünde yer almayan bazı temel hakların  Ayşe Özkan DUVAN Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 159 uygunluk denetimine konu oluşturan düzenlemelerin sahibi olarak yasama ve yürütme erkinin mensupları tarafından eleştiri konusu edilebilmektedir. Bununla birlikte Mahkeme tarafından gerçekleştirilen anayasaya uygunluk denetimi, siyasal kurumların taşkınlıklarını sınırlayabilecek tek mekanizma olarak güçlü bir meşruiyete sahip kabul edilmektedir.98 Anayasa normlarının çoğunun zorunlu olarak soyut biçimde kaleme alınmış olmasına bağlı olarak kavramların somutlaştırılması gereksinimi, kendiliğinden anayasa yargıcına geniş bir takdir yetkisi alanı oluşturmaktadır. Soyut anayasal normların yorumlanması aynı zamanda onların geliştirilmesi anlamına gelmektedir.99 Anayasada özellikle temel haklar alanında belirsiz ve geniş kavramlar vardır. Bu çerçevede siyasal iktidarın kötüye kullanılmasına karşı temel hakların korunmasını geliştirmeye hizmet eden mahkeme içtihatlarını, “yargısal aktivizm” zanlısı olarak değerlendirmek zorlama bir yaklaşımın sonucudur. Unutulmamalıdır ki anayasa yargısının meşruluğu, anayasanın üstünlüğü ve hukuk devleti ile kuvvetler ayrılığı ilkelerine dayanmaktadır. Öte yandan Türk Anayasa yargısında, yasama organının yasa çıkartırken Anayasa Mahkemesi tarafından iptal edilen yasaların iptal gerekçelerini ve sonuçlarını da nazara almak zorunluluğu söz konusudur.100 Buna göre Anayasa Mahkemesi içtihatlarının insan hakları söz konusu olduğunda önleyici denetim işlevine de sahip olduğunu kabul etmek gerekir. Özellikle de Anayasa’nın 90. maddesiyle birlikte değerlendirildiğinde anayasa yargıçlarının temel hak ve özgürlüklere ilişkin uluslararası hukuk normlarına, insan hakları-devlet diyalektiğinde hukuk devletini derinleştirme işlevinde başvurdukları belirtilmektedir.101 Türk Anayasa Mahkemesi aynı zamanda hukukun genel ilkelerini anayasa üstü referans norm kabul ederek ve Anayasa’nın 2. maddesindeki korunmasına içtihatlarında yer vermesi “hukuk yaratma tekniği”ne başvurulması olarak değerlendirilebilmektedir; Bkz. Yılmaz Aliefendioğlu, a.g.e., s. 191-192. Ancak bu gerçek anlamda bir hukuk yaratma değil, yargılamanın mantıksal sonucu olarak somutlaştırma yapılması anlamında bir hukuk üretimidir, Bkz. Zafer Gören, “Türk ve Alman Anayasa Hukukunda Anayasa Yargısnın Sınırları ve Yürürlüğü Durdurma Kararları”, Anayasa Yargısı Dergisi, Cilt 12, 1995, s. 211. 98 İbrahim Kaboğlu, Anayasa Yargısı: Avrupa Modeli ve Türkiye, İmge Kitabevi, Ankara 2000, s. 189-190-191; Rui Manuel Moura Ramos, “21. Yüzyılda Hak ve Özgürlükler Hareketleri ve Anayasa Mahkemelerinin Rolü”, Anayasa Yargısı Dergisi, Cilt 29, 2012, s. 511 ve s. 514; İlyas Doğan, Alman ve Türk Anayasa Yargısında Yürürlüğü Durdurma, Cemre Yayınevi, Diyarbakır 2000, s. 16. 99 Zafer Gören, “Siyasal Güç Faktörü Olarak Anayasa Mahkemesi”, İstanbul Ticaret Üniversitesi Sosyal Bilimler Dergisi, Yıl 6, Sayı 14, Güz 2008, s. 3. 100 AYM, 1993/26 E, 1993/28 K, 16.09.1993. 101 Tahsin Fendoğlu, a.g.m., s. 369. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 İnsan Hakları Hukukunun İçtihadî Kaynakları 160 hukuk devleti kavramının unsuru olarak yorumlamıştır.102 Bu doğrultuda aldıkları pek çok kararda Anayasa Mahkemesi yargıçları bazen karar gerekçesinde bazen de karşı oy görüşünde, kanun koyucunun takdir yetkisinin sınırlı olduğu anlayışını benimsemiştir.103 Bu bağlamda anayasa yargısının içtihat hukukunda güçlü bir konumu olduğunu kabul etmek gerekir. Bunun dayanağı da en açık şekilde Türk Anayasasının 90. maddesidir. Maddenin son fıkrasına göre “temek hak ve özgürlüklere ilişkin milletlerarası antlaşmalarla kanunların aynı konuda farklı hükümler içermesi nedeniyle çıkabilecek uyuşmazlıklarda milletlerarası antlaşma hükümleri esas alınır”. Bu bağlamda Türk Anayasa Mahkemesi temel haklara ilişkin uluslararası bildirgeleri ve antlaşmaları, anayasaya uygunluk denetimi yaparken verdiği kararlarda destekleyici standart normlar olarak kullanmaktadır. Özellikle Anayasa Mahkemesi’ne bireysel başvuru mekanizmasının kabulünden sonra Avrupa İnsan Hakları Sözleşmesi anayasa yargısı içtihatlarında odak noktası haline gelmiştir. Anayasa Mahkemesi Strazburg Mahkemesi’ni ilgilendiren 90. ve 148. maddelerdeki atfın AİHM içtihatlarını da kapsadığı yorumunda bulunmuş ve iki mahkemenin içtihatları arasında etkileşim gelişmiştir. Soyut ve somut norm denetiminde Anayasa Mahkemesi açık bir mevzuat hükmüne ihtiyaç duymadan Strazburg Mahkemesi’nin oluşturduğu içtihat hukukuna uymaya çalışarak104 kendi içtihatlarını oluşturmuştur. Mesela ana muhalefet partisi meclis grubu tarafında iptal davası açılması üzerine 16 Haziran 2011 tarihli kararında105 Türk Anayasa Mahkemesi hem adil yargılamaya ilişkin AİHS hükmüne, hem de AİHM içtihatlarıyla varlık kazanmış olan “silahların eşitliği” ve “yüz yüzelik” ilkelerini ölçüt almıştır.106 Anayasa yargıcının insan hakları alanındaki norm yaratıcı rolünün kabulüne esas teşkil eden anlayış, insan hakları hukukunun doğal hukuk anlayışından kaynak almasına dayanmaktadır. Dünyadaki tarihsel örneklere bakıldığında da aynı anlayışın izlerine rastlanır. Türk anayasa hukukundaki problematik, 1982 Anayasası’nın 12. maddesinin anayasada öngörülmeyen Avrupa Anayasa Mahkemeleri Konferansı: Avrupa daki Anayasa Mahkemelerinin İşbirliği, Türkiye Cumhuriyeti Anayasa Mahkemesi Raporu, 11-15 Mayıs 2014, s. 4. 105  AYM, 2008/12 E, 2011/104 K, 16.06.2011. 106  XVI. Avrupa Anayasa Mahkemeleri Konferansı: Avrupa daki Anayasa Mahkemelerinin İşbirliği, Türkiye Cumhuriyeti Anayasa Mahkemesi Raporu, 11-15 Mayıs 2014, s. 3. 160 Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4Ayşe Özkan DUVAN durumları anayasal etki alanına çekme gücüne sahip olup olmadığı noktasında düğümlenmektedir.  12.  maddenin  İtalyan  Anayasasının  2.  maddesi  gibi çekimleme  etkisine  sahip  olduğu  kabul  edildiği  takdirde,  değişkenlik gösteren tarihsel durum ve şartlarda siyasal ve hukuksal bilinçte maddileşen hak  ve  hürriyetler  de  12.  maddenin  kapsamında  değerlendirilebilecektir. Maddileşmenin şekillerinden birisi de, onaylanmamış da olsa, uluslararası antlaşmaları dokunulmazlık seviyesine çıkartarak anayasallaştırmaktır.107 İçtihat  yoluyla  anayasanın  geliştirilmesi  tekniği108  olarak  ifade edilen anlayışa göre, anayasada düzenlenmemiş olsa bile hukukun üstünlüğü ilkesine dayanarak tüm norm programlarının uygulanması yoluyla anayasanın zenginleştirilmesi  mümkündür.  Nitekim  Türk  Anayasa  Mahkemesi  1981 yılında verdiği bir kararında Medeni Kanun un 310. maddesinde, cinsel ilişki sırasında erkeğin evli olması durumunda babalığa hükmedilemeyeceği kuralını iptal ederken anayasayı zenginleştirme tekniğiyle somutlaştırmıştır.110 Söz konusu kararda Mahkeme, uluslararası hukuk metinlerine gönderme yaparak dava konusu düzenlemenin temel hak ve özgürlüklerin niteliğine, kanun  önünde  eşitlik  ilkesine  ve  ailenin  korunması  kuralına  aykırılığına hükmetmiştir.  Mahkeme  ayrıca  insan  onurunu  değerlendirdiği  bazı kararlarında  da  aynı  tekniği  uygulamıştır.111  Ayrıca  Anayasa nın  13. maddesinde düzenlenmiş bulunan ölçülülük ilkesi, hakkın özüne dokunmama ilkesi  ve  demokratik  toplum  düzeninin  gereklerine  uygunluk  ilkesi  gibi AİHM içtihatlarından yer bulan ilkeler, temel hakların sınırlandırılmasında temel aktör olan yasa koyucuya hitap etmektedir. Anayasa Mahkemesi bu sınırlama kriterlerini, özgürlükler lehine içtihat geliştirirken çıkış noktası olarak kullanabilmektedir.112 Anayasa Mahkemesi tarafından içtihat hukukuyla geliştirilmesi ihtiyacı bulunan durumlara dayanak oluşturan bazı anayasal hükümler ve Anayasanın başlangıç bölümü 6. paragrafıdır. Türk Anayasa Mahkemesi nin geliştirdiği yaklaşım bu yanıyla yukarıda sözü geçen Federal Alman Anayasa Mahkemesi tarafından geliştirilen anlayışla paralellik göstermektedir. Alman Anayasası 2. 107  Bakır Çağlar, a.g.m., s. 137. 108  Zafer Gören, Temel Hak Genel Teorisi, Dokuz Eylül Üniversitesi Yayınları, İzmir 2000, s. 92-93. 109  AYM, 1980/29 E, 1980/22 K, 21.05.1981. 110  Zafer Gören, Temel Hak Genel Teorisi, a.g.e.,  s. 93. 111  AYM, 1963/57 E, 1965/65 K, 27.12.1965. 112  Yusuf Şevki Hakyemez, a.g.e., s. 190. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 161İnsan Hakları Hukukunun İçtihadî Kaynakları maddesi 1. paragrafı Herkes başkalarının haklarını ihlal etmemek, Anayasal düzene veya ahlak kurallarına aykırı düşmemek koşuluyla, kişiliğini serbestçe geliştirme hakkına sahiptir hükmünü getirmektedir. Türk Anayasası başlangıç kısmının 6. paragrafı ise Her Türk vatandaşının bu Anayasadaki temel hak ve  hürriyetlerden  eşitlik  ve  sosyal  adalet  gereklerince  yararlanarak  millî kültür, medeniyet ve hukuk düzeni içinde onurlu bir hayat sürdürme ve maddî ve manevî varlığını bu yönde geliştirme hak ve yetkisine doğuştan sahip olduğu hükmünü getirmektedir. Anayasa 176. maddesine göre başlangıç kısmı anayasa metnine dâhil bulunduğuna göre her iki anayasal düzenlemenin bağlayıcılık düzeyleri de paralel olarak kabul edilebilir. Ayrıca başlangıç hükmünü  destekleyen  bir  başka  anayasal  düzenleme  5.  maddedir.  Türk Anayasası 5. maddesi Devletin temel amaç ve görevleri… insanın maddî ve manevî varlığının gelişmesi için gerekli şartları hazırlamaya çalışmaktır hükmünü  içermektedir.  5.  madde  gerekçesinde  …Devlet,  ferdin  hayat mücadelesini kolaylaştıracaktır. Ferdin insan haysiyetine uygun bir ortam içinde yaşamasını gerçekleştirecektir… ifadesi yer almaktadır. Yine Türk Anayasasının Kişinin dokunulmazlığı, maddi ve manevi varlığı başlığını taşıyan 17. maddesi Herkes, yaşama, maddî ve manevî varlığını koruma ve geliştirme hakkına sahiptir. hükmünü barındırmaktadır. 17. maddenin gerekçesinde,  kişinin  sahip  olduğu  hak  ve  özgürlüklerin  bu  maddeden başlayarak önem dereceleri göz önünde tutularak belirlendiği vurgulanmakta, dolayısıyla Anayasa koyucu maddi ve manevi varlığın bütünlüğü ve bunun geliştirilmesi hakkının Anayasayla garanti altına alınan insan haklarının en üst basamağında bulunduğunu kabul etmiş olmaktadır.113 Anayasa yargısı içtihatları, diğer yargı kolları bünyesinde görev yapan mahkemelere  nispetle  bağlayıcı  olması  hasebiyle  insan  hakları  hukuku alanında ön plana çıkmakla beraber, başta idari yargı olmak üzere adli yargı ve diğer yargı kollarındaki mahkemeler de senelerden beri İnsan Hakları Sözleşmesi  hükümlerini ve İnsan Hakları Mahkemesi içtihatlarını referans almaktadır.    Ayrıca  Türk  Anayasasının  148.  maddesinde  düzenlenerek 2012  yılında  uygulamasına  başlanan  Anayasa  Mahkemesi ne  bireysel başvuru  mekanizması  da,  AİHS  ve  ek  protokollerinin  yargı  mercileri tarafından  doğrudan  uygulanmasını  güçlendiren  önemli  bir  değişikliktir. Anayasa  Mahkemesi ne  bireysel  başvuru  mekanizması  çerçevesinde Anayasa  Mahkemesi,  AİHS  hükümlerini  ve  AİHM  içtihatlarını  dikkate 113  Zafer Gören, Avrupa Birliği Temel Haklar Şartı nın Ana İlkesi: Dokunulmaz İnsan Onuru, İstanbul Ticaret Üniversitesi Sosyal Bilimler Dergisi,  Yıl 6, Sayı 12, Güz 2007/2, s. 26.  162 Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4Ayşe Özkan DUVAN alma  yükümlülüğü  ile  karşılaşmıştır.114  Bireysel  başvurunun  işlevi  birey özgürlüklerinin korunmasıyla sınırlı değildir, ancak temel hakların içtihat hukukundaki kullanımını artıracağı açıktır.115 Türk mahkemelerinin yaklaşımında İnsan Hakları Sözleşmesi nin öne çıkmasının nedeni, Avrupa İnsan Hakları Mahkemesi nin taraf devletlerdeki yargısal uygulamaları denetleme yetkisine sahip olmasıdır. Buna göre ulusal mevzuatında AİHS  hükümlerinin  doğrudan  uygulanmasına  yer  veren  ya da vermeyen ülkelerde giderek daha ağırlıklı olarak yargı mercileri AİHM içtihatlarına  uygun  davranmakta  ya  da  en  azından  istifade  etme  yoluna gitmektedir. 116 Son yıllarda hâkim olan bu uygulamanın nedeni temel hakların yargısal düzeyde korunmasının ulusal sınırlardan uluslararası sınırlara taşınmış olmasıdır.  Bu noktada AİHS hukuku ile birlikte AB hukukunun insan hakları korumasını da beraber değerlendirmek gerekmektedir. AB üye ülkelerinin ve AİHS ye  taraf  olan  ülkelerin Anayasa  Mahkemeleri  arasında  yapılan müşterek çalışmalar Avrupa da bir ortak insan hakları hukuku inşa süreci içinde bulunduğumuzun ipuçlarını ortaya koymaktadır.117 Avrupa Birliği nin bağlayıcılık vasfı bulunan insan hakları bildirgesi olan Temel Haklar Şartı na  bir kararında Türk Anayasa Mahkemesi atıfta bulunmuştur. 8 Aralık 2011 tarihli kararında Anayasa Mahkemesi AB Temel Haklar Şartı nın eşitlik ilkesine ilişkin 20. maddesine atıfta bulunmuştur. Birçok kararında Mahkeme, Uluslararası  Adalet  Divanı  kararlarından  faydalanmıştır.120  Danıştay  ve Yargıtay kararlarında ise Birleşmiş Milletler ve Avrupa Konseyi bünyesindeki pek çok Sözleşmeye atıf yapılmıştır. İdari yargı mahkemelerinden derece mahkemeleri  de  sıklıkla  İnsan  Hakları  Sözleşmesi  hükümlerine  karar gerekçelerinde yer vermektedir.121 114  XVI. Avrupa Anayasa Mahkemeleri Konferansı: Avrupa daki Anayasa Mahkemelerinin İşbirliği, Türkiye Cumhuriyeti Anayasa Mahkemesi Raporu, 11-15 Mayıs 2014, s. 2. 115  Korkut Kanadoğlu, Anayasa Mahkemesi ne Bireysel Başvuru, XII. Levha, İstanbul 2015, s. 10. 116  İbrahim Şahbaz, Avrupa İnsan Hakları Mahkemesi nin Türk Yargı Sistemindeki Yeri, Türkiye Barolar Birliği Dergisi, Sayı 54, 2004, s. 181. 117  Alfonso Quaranta, İtalyan Anayasası nda Temel Hakların Korunması, Anayasa Yargısı Dergisi, Cilt 29, 2012, s. 788. 118  Funda Keskin, Avrupa Birliği ve İnsan Hakları, Siyasal Kitabevi, Ankara, Ocak 2013, s. 37. 119  AYM, 2010/119 E, 2011/165 K, 8.12.2011. 120  XVI. Avrupa Anayasa Mahkemeleri Konferansı: Avrupa daki Anayasa Mahkemelerinin İşbirliği, Türkiye Cumhuriyeti Anayasa Mahkemesi Raporu, 11-15 Mayıs 2014, s. 3. 121  Hüseyin Bilgin, Avrupa İnsan Hakları Mahkemesi Kararlarının Türk İdari Yargısına Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 163İnsan Hakları Hukukunun İçtihadî Kaynakları Türk yargı mensuplarının Avrupa İnsan Hakları Sözleşmesi hükümlerine ve Strazburg Mahkemesi nin içtihatlarına başvurmasının bir başka nedeni ulusal  mevzuatımızın  da  bunu  gerektirmesidir. Anayasa nın  90.  maddesi son  fıkrası  ile  Anayasa  Mahkemesi ne  bireysel  başvuruyu  düzenleyen mevzuat  hükümleri,  yargıçlarımızın  insan  haklarına  ilişkin  uluslararası standartları takip etmesini gerektirmektedir. Ayrıca Avrupa İnsan Hakları Mahkemesi de Sözleşme hükümleriyle yetinmeyerek kendi içtihat hukukunu oluşturmaktadır. Mesela Sözleşme nin 6. maddesinde düzenlenmiş olan adil yargılanma hakkına ek olarak, hakkaniyete uygun şekilde dinlenilme hakkını, mahkeme önünde hak arama özgürlüğünü, taraﬂ ar arasında silah eşitliğini, yargılamada vicahilik (yüz yüzelik) hakkını da içtihat etmiştir.122 Bu halde yargıçlarımız cephesinden Strazburg Mahkemesi nin içtihat hukukunu takip etmek yükümlülüğü de kaçınılmaz olarak ortaya çıkmaktadır. Bu çerçevede Türk  Anayasa  Mahkemesi,  bireysel  başvuru  mekanizması  çerçevesinde yapılan dört bini aşkın müracaatın kabul edilebilirlik kararlarını Strazburg Mahkemesi içtihatlarını nazara alarak vermiştir.123 Sonuç İnsan hakları hukukunun içtihadî kaynaklarına ilişkin çalışmamız, son yıllarda ihmal edilmiş olduğunu değerlendirdiğimiz bir konuya ışık tutmayı amaçlamaktadır. İnsan hakları hukukunu diğer hukuk dallarından ayıran temel özellik, yenilikçi ve güncel bir hukuk dalı olmasıdır. Diğer hukuk dallarında birey özgürlüğünü ilgilendiren boyutu bulunan pek çok uyuşmazlık, insan hakları hukukundaki çalışmalar sayesinde çözüme kavuşturulabilmektedir. Bu nedenle insan hakları hukukunun kaynaklarını sayarken içtihadî kaynakları ihmal etmemek gerekir. Mahkeme kararları mevzuatın uygulamadaki neticesi olmakla  beraber,  mevzuatta  yer  almayan,  yazılı  olmayan  temel  hak  ve hürriyetlerin ve ilkelerin geliştirilmesine de hizmet eder niteliktedir. Temel hak ve özgürlüklerin korunması alanındaki her bir ileri adım, tüm hukuk dallarının gelişimine katkıda bulunabilecek potansiyeldedir.   Bundan yola çıkılarak yirmi birinci yüz yıl Avrupasında mahkemelerin, ülkelerin ulusal anayasalarının başgardiyanı olarak işlemesi gerektiği görüşü benimsenmiştir.124 Yansımaları, Adalet Yayınevi, Ankara 2014. 122  Ergin Ergül, Anayasa Mahkemesine Bireysel Başvuru: Anayasa Mahkemesi ve Avrupa İnsan Hakları Mahkemesi Kararları Işığında Bireysel Başvuru Yolunun Anatomisi, Temmuz 2015,  s. 191. 123  XVI. Avrupa Anayasa Mahkemeleri Konferansı, a.g.e., s. 3. 124  Maartje de Visser, Constitutional Review in Europe: A Comperative Analyses, A&C Black, Temmuz  2014. 164 Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4Ayşe Özkan DUVAN Anayasa Mahkemesi yargıçları başta olmak üzere yargı mensuplarının, diğer devlet organları, yasama ve yürütme karşısında kendi konumlarını tanımlarken, hukuksal sınırları tespit görevi ile hukuksal aktivizm arasında bir uzlaşmaya varmaları gerekmektedir. Bu denge sağlanabildiği takdirde mahkeme içtihatlarının insan hakları hukukuna kaynaklık etmesi yönünde yürütülen çalışmalar hukuksal gelişmeye hizmet edecektir. Özellikle Türk Anayasası hükümleri uyarınca temel hak ve özgürlüklerin korunmasına ilişkin ulusal mevzuatı ve uluslararası sözleşmeleri doğrudan uygulamakla yükümlü kılınmasından sonra, ilk derece mahkemelerinin de dahil olmak üzere tüm yüksek mahkemelerin ve Anayasa Mahkemesi nin içtihatlarında insan hakları perspektiﬁ ne daha ağırlıklı bir yer verilmesi gerekmektedir. Bireysel başvuru mekanizmasının hukukumuza girmesiyle birlikte Türk Anayasa Mahkemesi nin bu alandaki önemi daha da artmıştır. Çünkü bireysel başvuru mekanizmasının kabulüyle Anayasa Mahkemesi, AİHS hükümleri ve AİHM içtihatlarının yer verdiği, ancak ulusal hukukumuzda daha önce konu edilmemiş olabilecek hak ve özgürlüklerin korunması ve yeni koruma usullerinin geliştirilmesi gibi edimlerin yükümlüsü konumunu edinmiştir. Bu  nedenle  Anayasa  Mahkemesi  yargıçlarının  yetki  sınırlarına  ilişkin tartışmalarda, temel hak ve özgürlüklerin korunmasına ilişkin çalışma alanını Anayasa Mahkemesinin diğer çalışma alanlarından ayırmak gerekmektedir.  Kanımızca Anayasa Mahkemesi ne bireysel başvuru usulüyle götürülecek hukuksal uyuşmazlıklarda verilecek kararlar, insan hakları hukukunun etkin bir şekilde içtihatlarla beslenmesini güçlendirme potansiyeline sahiptir.",
     "Kaynakça": "Acer, Yücel - Kaya, İbrahim, Uluslararası Hukuk: Temel Ders Kitabı, Seçkin Yayınları, Ankara, Ekim 2015. Aliefendioğlu,  Yılmaz,  Anayasa  Yargısı  ve  Türk  Anayasa Mahkemesi, Yetkin Yayınları, Ankara 1996. Arsava, A. Füsun, “Temel Hakların Alman Anayasa Hukuku Örneğinde, AİHK  ve  AB  İlişkisi  Çerçevesinde  Yorumu”,  Uluslararası  Hukuk  ve Politika, Cilt 7, Sayı 27. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 165İnsan Hakları Hukukunun İçtihadî Kaynakları Arsava,  A.  Füsun,  “ATAD ın  Hukuk  Yaratma  Yetkisi”,  Ankara Üniversitesi Siyasal Bilgiler Fakültesi Dergisi, Cilt 3, Sayı 54, ss. 13-28. Beaney, William M., American Constitutional Law: Introductory Essays and Selected Cases, Prentice-Hall İnc., New Jersey, 1964. Bilgin, Hüseyin, Avrupa İnsan Hakları Mahkemesi Kararlarının Türk İdari Yargısına Yansımaları, Adalet Yayınevi, Ankara 2014. Bilgen, Pertev, İdare Hukuku Dersleri: İdare Hukukuna Giriş, Filiz Kitabevi, İstanbul 1999. Chinkin, Christine, “Sources”, Daniel Moeckly-Sangeeta Shah-Sandesh Sivakumaran (Der.), International Human Rights Law, Oxford University Press, 2010. Costelloe, Daniel - Fitzmaurice, Malgosia, «Lawmaking by Treaty: Conclusion of Treaties and Evolution of Treaty Regimes in Practice «, Cathrine Brölmann - Yannick Radi (Der.), Theory and Practice of International Lawmaking, Elgar Publishing, Cheltenham UK- Northampton MA USA, 2016, ss. 111-131. Croquet, Nicolas A. J. “The International Criminal Court and the Tratment of Defence Rights: A Mirror of the European Court of Human Rights  Jurisprudence”, Human Rights Law Review, Cilt 11, Sayı 1, 2011. Çağlar, Bakır, “Anayasa Yargısı ve Normatif  Devreler Karşılaştırmalı Analizi”, Anayasa Yargısı Dergisi, Cilt 6, 1989. Çağlar, Bakır “Anayasa Yargısında Yorum Problemi: Karşılaştırmalı Analizin Katkıları”, İstanbul Üniversitesi İdare Hukuku ve İlimleri Dergisi, Cilt 5, Sayı 1-3, 1984. Doğan, İlyas, İnsan Hakları Hukuku, Astana Yayınları, Ankara, Eylül 2015. Doğan,  İlyas,  Alman  ve  Türk  Anayasa  Yargısında  Yürürlüğü Durdurma, Cemre Yayınevi, Diyarbakır 2000. Ergül, Ergin, Anayasa Mahkemesine Bireysel Başvuru: Anayasa Mahkemesi ve Avrupa İnsan Hakları Mahkemesi Kararları Işığında Bireysel Başvuru Yolunun Anatomisi, Temmuz 2015. Eroğul, Cem, Çağdaş Devlet Düzenleri: İngiltere, Amerika, Fransa, Almanya, Seçkin Yayıncılık, Ağustos 2014. 166 Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4Ayşe Özkan DUVAN Fendoğlu,  Tahsin,  Uluslararası  İnsan  Hakları  Belgelerinin Uygulanmasında “Bağımsız Ölçü Normveya “Destek Ölçü NormSorunu, Anayasa Yargısı Dergisi, Cilt 17. Gedik, Fırat - Koç, Emel, “Hüküm Kurma ve İçtihat”, Ankara Barosu Dergisi, Cilt 67, Sayı 2, Bahar 2009. Gören,  Zafer,  “Türk-Alman  Hukukunda  Kişiliğin  Korunması”, Anayasa Yargısı Dergisi, Sayı 73, Cilt 9, 1992. Gören, Zafer, “Siyasal Güç Faktörü Olarak Anayasa Mahkemesi”, İstanbul Ticaret Üniversitesi Sosyal Bilimler Dergisi, Cilt 6, Sayı 14, Güz 2008. Gören, Zafer, Anayasa Hukuku, Yetkin Hukuk Yayınları, Mayıs 2011. Gören, Zafer, “Türk ve Alman Anayasa Hukukunda Anayasa Yargısının Sınırları ve Yürürlüğü Durdurma Kararları”, Anayasa Yargısı Dergisi, Cilt 12, 1995. Gören, Zafer, Temel Hak Genel Teorisi, Dokuz Eylül Üniversitesi Yayınları, İzmir 2000. Gören,  Zafer,  “Avrupa  Birliği  Temel  Haklar  Şartı nın Ana  İlkesi: Dokunulmaz İnsan Onuru”, İstanbul Ticaret Üniversitesi Sosyal Bilimler Dergisi,  Cilt 6, Sayı 12, Güz 2007/2.  Göze, Ayferi,  Siyasal  Düşünceler  ve Yönetimler,  Beta Yayınları, İstanbul 2013. Gözler, Kemal, Genel Hukuk Bilgisi, Ekin Basım Yayın Dağıtım, Bursa 2008. Gözübüyük, Şeref, Hukuka Giriş ve Hukukun Temel Kavramları, Turhan Kitabevi, Ankara 2013. Hakyemez,  Yusuf  Şevki,  Hukuk  ve  Siyaset  Ekseninde Anayasa Mahkemesinin Yargısal Aktivizmi ve İnsan Hakları Yaklaşımı, Yetkin Yayınları, Ankara 2009. Hekimoğlu, Mehmet Merdan, Alman Hukuku Işığında Türk Anayasa Yargısının Hukuki Boyutları, Detay Yayıncılık, Ankara 2004. Helmholz, R. H., “Continental Law and Common Law: Historical Strangers or Companions”, Duke Law Journal, Cilt 39, Sayı 6, Aralık 1990. Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 167İnsan Hakları Hukukunun İçtihadî Kaynakları Kaboğlu, İbrahim, Özgürlükler Hukuku: İnsan Haklarının Hukuksal Yapısı, Afa Yayıncılık, İstanbul 1998. Kaboğlu,  İbrahim Ö., Anayasa Yargısı: Avrupa Modeli ve Türkiye, İmge Kitabevi, Ankara 2000. Kanadoğlu, Korkut, Anayasa Mahkemesi ne Bireysel Başvuru, XII. Levha, İstanbul 2015. Keskin, Funda, Avrupa Birliği ve İnsan Hakları, Siyasal Kitabevi, Ankara, Ocak 2013. Lawrence, Baum, “The Supreme Court in American Politics”, Annual Review of Political Science, Cilt 6, Haziran 2003. Mason,  Alpheus  Thomas  -  Stephenson,  Donald  Grier,  American Constitutional Law: Introductory Essays and Selected Cases, Prentice Hall, New Jersey, 1990. McRudden,  Christopher,  “Common  Law  on  Human  Rights: Transnational  Judicial  Conversation  on  Constitutional  Rights”,  Oxford Journal of Legal Studies, Cilt 20, Sayı 4, Kış 2000. Mellinghof,  Rudolf,  “Federal  Almanya  Cumhuriyeti nde  Anayasa Şikayeti”, Anayasa Yargısı Dergisi, Sayı 26, 2009. Metin, Yüksel, “Türkiye de Yargı Bağımsızlığına İlişkin Kimi Sorunlar ve Çözüm Önerileri”, Anayasa Yargısı Dergisi, Cilt 27, 2010. Öğütçü, Muhlis, “Doğal Hukuk ve Pozitif Hukuk Işığında İnsan Hakları Alanındaki Bazı Kavramlar”, Prof. Dr. İrfan Baştuğ Anısına Armağan, Dokuz Eylül Üniversitesi Hukuk Fakültesi Dergisi, Cilt 7, Özel Sayı 2005, ss. 555615. Özbudun, Ergun, Türk Anayasa Hukuku, Yetkin Yayınları, Ankara 1995. Quaranta, Alfonso, “İtalyan Anayasası nda Temel Hakların Korunması”, Anayasa Yargısı Dergisi, Cilt 29, 2012. Ramos,  Rui  Manuel  Moura,  “21.  Yüzyılda  Hak  ve  Özgürlükler Hareketleri ve Anayasa Mahkemelerinin Rolü”, Anayasa Yargısı Dergisi, Cilt 29, 2012. Rehman, Javaid, International Human Rights Law: A Practical Approach, Longman, England 2003. 168 Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4Ayşe Özkan DUVAN Schulze, Hagen, Avrupa da Ulus ve Devlet, Çev. Timuçin Binder, Literatür Yayıncılık, İstanbul 2005. Stone,  Alec,  The  Birth  of  Judicial  Politics  in  France:  The Constitutional Council in Comparative Perspective, Oxford University Press,  New York-Oxford 1992. Şahbaz, İbrahim, “Avrupa İnsan Hakları Mahkemesi nin Türk Yargı Sistemindeki Yeri”, Türkiye Barolar Birliği Dergisi, Sayı 54, 2004. Tunç, Hasan, Karşılaştırmalı Anayasa Yargısı (Denetimin Kapsamı ve Organları), Yetkin Yayınları, Ankara 1997. Ünal, Şeref, “İnsan Haklarının Tarihi, Felseﬁ  ve Hukuki Temelleri”, Ankara Barosu Dergisi, Sayı 1, 1994. Visser, Maartje de, Constitıtional Review in Europe: A Comperative Analyses, A&C Black, July 2014. Warren, Charles, “New Light on the History of the Federal Judiciary Act of 1789”, Harvard Law Review, Cilt 37, Sayı 1, Kasım 1923. Yazıcı,  Serap,  «Ulus  Devletten  Ulusüstü  Devlete  Geçişte  Hukuk Devleti», Ankara Üniversitesi Hukuk Fakültesi Dergisi, Cilt 54, Sayı 4, Ankara 2005. Zoller, Elisabeth, “The United States Supreme Court and the Freedom of Expression”, Indiana Law Journal, Cilt 84, Sayı 885, 2009.   Gazi Üniversitesi Hukuk Fakültesi Dergisi C. XX, Y. 2016, Sa. 4 169"
}